<style>
body {
	background: url(img/page/fire.png) left bottom no-repeat fixed, url(img/page/getrs.jpg) fixed no-repeat !important;
	background-size: cover;
	margin: 0;
}
header {
	width: 750px;
	margin: 0 auto;
}
header img {
}
article {
	width: 750px;
	margin: 0 auto;
	background: #fff url(img/page/noise.png);
	padding: 20px 50px;
	box-shadow: 0 0 50px 0 rgba(0, 0, 0, 0.7);
}
article h1 {
	text-align: center;
}
article .epigraph {
	text-align: right;
	font-size: 13px;
	font-style: italic;
}
article p {
	text-align: justify;
	font-size: 15px;
}
article .source {
	text-align: right;
	font-size: 13px;
	font-style: italic;
}
</style>
<header>
	<a href="firebook/probability"><img src="img/page/firebible.logo.png"></a>
</header>
<article>
<h1 id="post1">О чудесах</h1>
<div class="epigraph">Лучшее, что нам доступно, это самопознание.</div>
<hr>
<p>Спрашивают, что я думаю о чудесах. Хорошо, давайте обсудим чудеса.
</p><p>
Прежде всего, надо понять, что это такое. Есть несколько вариантов:
</p><p>
1) События, противоречащие законам природы.
</p><p>
Например, если фокусник материализовал кролика в ранее пустой шляпе, он нарушил фундаментальный закон физики — закон сохранения энергии-массы.
</p><p>
Можно нарушать не только физические законы, но и химические или биологические.
</p><p>
Например, если девственница родила мальчика, то непонятно, откуда у этого мальчика взялась Y-хромосома. Такое событие кардинально нарушает законы биологии и потому является чудом.
</p><p>
Для простоты предлагаю считать, что нарушить законы природы нельзя. Если кто-либо утверждает, что он это сделал, необходимо предъявить доказательства, исключающие всевозможные альтернативные объяснения (фокусник отвлёк наше внимание и переместил кролика в шляпу из другого места, "девственница" вступала в половую связь с римским центурионом, но постеснялась признаться и т.п.), поскольку они априори более вероятны, а также придумать объяснения, в которые бы, помимо предлагаемого чуда, вписывались все предыдущие наблюдения и новые факты.
</p><p>
Тут есть небольшая тонкость. Мы, очевидно, ещё не знаем всех законов природы, а те, что знаем, наверняка будут уточняться в будущем. Однако их уточнения должны давать те же результаты, что и нынешние теории в общих рамках их применимости и в пределах погрешностей нынешних измерений. Для описания событий в "бытовых" масштабах накопленных человечеством знаний обычно более чем достаточно.
</p><p>
Например, можно попытаться сказать, что народный целитель ощущает "биополе" (или "ауру") пациента и пытается его "исправить", делая те или иные пассы. Однако физике известно только четыре (хорошо, пять) фундаментальных взаимодействий, и если бы существовали какие-либо ещё, способные воздействовать на крупные предметы вроде человеческих тел, сверхточные физические приборы давно бы зафиксировали их проявления. Поэтому любые "биополя" должны объясняться комбинацией существующих полей. Говорят, на самом деле целители ощущают руками градиент тепла (или инфракрасного излучения), исходящего от тела пациента, и находят те точки, где тепла чуть больше или чуть меньше — это узлы, в которых проблема. Не знаю, так это или нет, но в любом случае ничего сверхестественного здесь нет.
</p><p>
2) Априори возможные, но маловероятные события.
</p><p>
Например, априорная вероятность того, что президент хоть какой-нибудь страны выиграет главный приз в общенациональной лотерее порядка одной миллионной. Однако в Зимбабве такое чудо случилось.
</p><p>
Или, например, если я играю в напёрстки 100 раз подряд, указываю на случайно выбранный стаканчик и каждый раз не угадываю, где шарик, то происходит событие с априорной вероятностью (2/3)^100 — примерно 2*10^{-18}. По идее, такого не должно случиться ни разу, даже если каждый житель Земли будет повторять этот опыть раз в день.
</p><p>
Кроме того, очень мала вероятность того, что в каком-нибудь регионе абсолютно все жители проголосуют за действующую власть. Такое тоже случается.
</p><p>
Несложно видеть, что в данных примерах неправильно вычислялась (занижалась) априорная вероятность события, потому что не учитывалась часть существенных факторов.
</p><p>
Другой пример — все молекулы в этой комнате соберутся в той её половине, где нет меня, и я задохнусь. Вероятность подобного рода событий, напротив, настолько мала (порядка 10^{-10^{23}}), что оно не случится ни разу за всё существование Вселенной. Таким образом, нарушение второго закона термодинамики формально является чудом второго рода, но на самом деле правильнее считать его чудом первого рода (нарушением фундаментального закона физики).
</p><p>
Сюда же относится, например, спонтанное восстановление разбитой чашки из осколков, а также воскрешение из мёртвых (смерть — это по определению "необратимое прекращение жизненных функций").
</p><p>
3) События, не нарушающие законов природы и не являющиеся маловероятными, но ошибочно воспринимаемые как таковые.
</p><p>
Например, маленькие дети не понимают, как именно фокусник вытаскивает кролика из шляпы или почему распиленная им ассистентка оказывается живой, и считают, что произошло нечто чудесное, а на самом деле произошёл фокус.
</p><p>
К сожалению, в ситуациях, когда нам заранее не сообщают, что производится фокус, даже взрослый человек (и даже профессиональный учёный) может не понять, что происходит, и решить, что случилось "чудо" или зафиксировать случай телепатии и прочих экстрасенсорных способностей. Когда фокусами начинают пользоваться для мошенничества, простым людям сложно поймать мошенника за руку, и если они доверчивы — приходится признать, что имело место чудо. Кстати, когда в 19-м веке была мода на медиумов, довольно известные учёные не могли понять, в чём дело, и признавали существование духов, экстрасенсорных способностей и т.п. Потом к разоблачению медиумов стали привлекать специалистов — то есть фокусников — и ситуация исправилась. (На эту тему есть интересная книжка Хэнзела, переведённая на русский язык.)
</p><p>
Другие примеры таких чудес. Известный иллюзионист Ури Геллер призывает телезрителей принести к экрану поломавшиеся часы, чтобы он мог своими пассами их дистанционно починить, а затем просит позвонить тех, у кого получилось. Оказывается, что если просто встряхнуть старые поломавшиеся часы, то с небольшой вероятностью вроде одной десятитысячной они могут пойти (например, если дело в пылинке, попавшей не туда). Если передачу смотрит миллион зрителей, и десятая часть из них действительно принесёт к экрану старые часы, Ури Геллер получит десятки телефонных звонков от изумлённых телезрителей.
</p><p>
Как видим, вероятность на самом деле не очень мала (1000000 * 0.1 * 0.0001 = 10 успешных случаев), но изначально воспринимается как очень маленькая.
</p><p>
Кстати, это свойство человеческого мозга — он плохо работает с очень маленькими (и очень большими) числами. Интуитивно всё, что меньше одной сотой — это "очень мало". На самом деле между вероятностями в одну миллионную и 10^{-10^{23}} очень большая разница. События вероятностью одная миллионная происходят сплошь и рядом, если наблюдений много (например, если их производят все жители Земли). События вероятностью 10^{-10^{23}} не случатся ни разу за всё существование Вселенной.
</p><p>
Или такой пример — жрецы разводят огонь на жертвеннике храма и возносят молитвы к своим богам, а ворота храма чудесным образом сами открываются. Доверчивые зрители говорят о чуде и начинают жертвовать жрецам. Такой вот пневматический механизм придумал Герон Александрийский пару тысяч лет назад.
</p><p>
Думаете, сейчас такое не прокатит? Как насчёт современного примера — в храме заблаговременно пропитывают фитили свеч соединениями фосфора, но свечи не зажигают. Затем в храм пускают публику и заслуженного жреца (демонстрируя, что у него нет спичек), и он начинает молиться. Через какое-то время свечи спонтанно зажигаются, а доверчивым зрителям объясняют, что это чудо, произведённое божеством в ответ на действия жреца. 
</p><p>
До сих пор находятся люди, верящие в подобное.
</p><p>
4) Нечто, субъективно и эмоционально воспринимаемое как чудесное, хотя и не являющееся необычным.
</p><p>
Скажем, радуга или красивый закат могут произвести впечатление чуда и вызвать эмоциональный подъём. Аналогично с красивым стихотворением или неожиданным научным озарением.
</p><p>
Такого рода чудеса нравятся и мне.
</p><p>
5) Почему людям хочется верить в чудеса?
</p><p>
По всей видимости, люди легко обманываются разнообразными фокусниками, жрецами и прочими мошенниками, или даже самими собой (вопреки здравому смыслу объясняя чудесами то, что на самом деле являтся природным явлением или случайным совпадением) потому, что им хочется обманываться. Почему-то чудесные объяснения нам более импонируют, чем правильные, но "скучные" рациональные объяснения. Конечно, на людей с научно-технической складом ума именно эти рациональные объяснения могут произвести впечатление большего чуда в смысле 4) (например, объяснение разнообразия земной биосферы через теорию эволюции, на мой взгляд, гораздо интереснее, чем через акт произвольного творения высшими силами), но не будем отвлекаться. Как мы видели, даже серьёзные учёные иногда бывают сбиты с толку и готовы поверить в "экстрасенсорные" способности и прочих медиумов и провидцев.
</p><p>
Интересно понять, откуда у людей эта склонность верить в чудеса и объяснять всё чудесами вместо того, чтобы искать рациональное объяснение. Должно быть биологическое, социальное и психологическое обоснование этого явления. Вот некоторые соображения на эту тему.
</p><p>
а) Объяснение через чудеса явлений, не являющихся жизненно важными, экономит умственные усилия, меньше напрягает мозг, а значит, требует меньше глюкозы и меньше еды — иначе говоря, буквально является более экономным и более выгодным. На протяжении миллионов лет эволюции предков человека это могло быть полезным — если знание о том, что Солнце — это огромный шар, вокруг которого вращается меньший шар-Земля, не приносит практической пользы, то не лучше ли не тратить ресурсы на обдумывание подобных истин, а вместо этого объяснить восходы и заходы мифологическими и чудесными причинами?
</p><p>
б) Дети в маленьком возрасте сильно зависят от взрослых и от того, чему их взрослые научат. При этом фундаментальным является некритическое восприятие того, что говорят взрослые. Сюда относятся упрощённые описания бытовых явлений через чудеса, сказки и мифологию, способствующие, однако, правильному поведению детей (увеличивающие их шансы на выживание). Привыкнув к чудесам в детстве, сложно полностью отказаться от них потом, особенно если это не считается зазорным в обществе. Кстати, обычно годам к десяти все перестают верить в Деда Мороза (потому что сверстники будут смотреть на того, кто не перестанет, как на идиота), а вот в различного рода богов и пророков (а также в демократию) некоторые люди продолжают верить даже во взрослом возрасте (потому что не создаётся подобного давления в обществе — оно скорее может быть создано в обратную сторону).
</p><p>
в) Социальное давление. Если все вокруг во что-то верят, гораздо проще поверить в это или сначала просто сделать вид, что поверил — а потом незамысловатые психологические механизмы сделают так, что человек действительно поверит. Таким образом, например, несколько человек в компании, сговорившись, могут заставить оставшегося поверить, что нечто было (например, что они все вместе видели ранее умершего наставника), имплантировав в его сознание сначала сомнения, а потом уверенность в нужной им версии событий. Если же уверенность транслируется не просто несколькими людьми, а всем обществом (или тоталитарной сектой, в которую вы попали), то устоять против веры в чудеса и общепринятые чудесные объяснения будет очень сложно.
</p><p>
г) Человеческий мозг — это машина для поиска шаблонов и корреляций между поступающими данными. Таково его устройство, и в этом его сила и его слабость. Понятие причинно-следственной связи не "зашито" в наш мозг, а вырабатывается в процессе обучения, равно как, например, умение складывать числа. А вот корреляции мы фиксируем автоматически и затем начинаем их использовать. Если после того, как нам перешла дорогу чёрная кошка, мы не сдаём экзамен, у нас фиксируется корреляция, при этом мы обычно не пытаемся произвести затратный высокоуровневый анализ причинно-следственных связей. Затем, если после очередной чёрной кошки произойдёт что-нибудь плохое, мы скажем: "ага, примета работает", несмотря на то, что было много случаев, когда чёрная кошка переходила нам дорогу, но ничего плохого не случалось и мы об этом благополучно забывали.
</p><p>
Иначе говоря, сам принцип устройства мозга способствует выделению шаблонов из случайного шума. Мы можем вполне увидеть контуры непонятного зверя в тёмном саду просто потому, что луна осветила дерево с необычного угла. Может быть, это не так плохо с эволюционной точки зрения — а вдруг там действительно притаился леопард, и надо действовать, а не раздумывать, померещилось это или нет. Однако в итоге появляются рассказы о леших и прочих чудесах. 
</p><p>
* * *
</p><p>
Как-то так. Извините, если вы верили в чудеса, приметы, экстрасенсов и прочую магию, а я вас разочаровал — но я действительно считаю, что чудеса науки и техники, а также искусства, гораздо интереснее всех этих древних заблуждений, ошибок человеческого восприятия, фокусов и мошенничества. Подумайте, какова бы была реакция древнего человека, если бы вы ему показали свой айфон — а ведь для нас это нечто обыденное. И это только начало.
</p><p>
Чудесам есть место в нашей жизни. Однако нужно искать их там, где они действительно есть, а не заниматься самообманом.
</p><p class="source">
<a href="http://vk.com/id6">Николай Дуров</a>. 16/01/2014
</p>
</article>