<h1>Во избежание несчастных случаев... - Как выйти замуж за программиста</h1>

<p>После нечаянно ставшего эпическим <a href="http://users.livejournal.com/akme_/154221.html">поста</a> про программистов, многие девушки обращаются с этим вопросом ко мне, будто бы я видный  в этом вопросе эксперт. <br>Я конечно же не эксперт и вообще они все разные, но все же скажу. Потому что когда ж я молчала, когда меня с почтением спрашивали? Итак, отвечаем.

<p><b>Часть I: Найти</b>

<p>Чтобы выйти замуж за программиста нужно его сначала найти.

<p>Ареал обитания програмимстов находится сами знаете где - в софтверных конторах и  компьютерных отделах обычных контор. Счастливы те компании, где IT отдел и, скажем, бухгалтерия сидят рядом... Но не всем так везет. 

<p>Поэтому иногда искать программистов приходится в Других Местах.

<p>Локация этих Мест зависит от степени зрелости программиста. Юные - еще пасутся на интернет-форумах и робко знакомятся по аське. Чуть более зрелые, входящие в силу часто встречаются на разных экзотических мероприятиях в реале - курсах японского языка, секциях парашютного спорта, кружках игры на 12-струнной гитаре и в группах вечернего болейбола. Бывают они там, как правило, не более одного - двух раз, пока их не "находят", но в краткий свой миг они там прекрасны. 

<p>Самый же ценный подвид это матерые программисты. Они очень редки, потому что мало кто из них доживает до этой стадии в холостом стоянии. К тому же встретить их крайне сложно - они  уже нигде кроме работы не бывают, потому что сурьезные очень.
	<br>И при этом, матерые программисты уже имеют оперение в виде квартиры, машины и всего того, что истинно бескорыстной барышне, конечно, совершенно не важно, но все-таки вселяет оптимизм. Словом золотое руно, да и все тут.
	<br>Чтобы найти такого надо погрузиться в проблему полностью - пойти работать в сферу IT.

<p>В предыдущей конторе, у меня таких было аж 8 штук. Я чувствовала себя алибабой. 

<p><b>Часть II: Приручить</b>

<p>Ну, ладно. Предположим мы его нашли. Что с ним делать дальше?

<p>Хочется, конечно, первым делом постричь, похудеть, отобрать все футболки с остроумными надписями, турецкие свитера, а так же заставить купить штаны более подходящего размера.
	<br>Но нельзя, девочки. Нельзя.
	<br>Потому что мужчины, они не золушки и не ждут всю свою жизнь, чтобы их переодели и приукрасили. Более того, чтобы их приукрасить и переодеть нужно их сначала приручить, а не наоборот!

<p>Поэтому нужно терпеть. Терпеть и любить его как человека. Буквально, как встарь, за прекрасный внутренний мир.

<p>Вот, кстати, многие думают, что отмороженный внешний вид программистов происходит из-за их общей неприкаянности, невнимания к себе и врожденной безвкусицы. А между тем, это не так. 

<p>Последние исследования показали, что это продуманная брачная окраска обусловленная соответствующей матримониальной стратегией. Используя растянутые на коленках джинсы и неглаженые футболки с надписями "Йа креведко" программисты умело избегают когтистых лапок глянцевых блондинок с активной потребительской позицией и попадают в руки более гуманных женских существ.

<p>Приручать программистов нужно тихо и ненавязчиво, самыми что ни на есть консервативными способами: приготовить завтрак, помыть пол, поправить воротничек, попросить починить компьютер и вывести погулять. Идея состоит в том, чтобы кротко внедриться в алгоритм его жизни и оттуда не выпасть. Хотя последнее мало вероятно, так как, сами понимаете, это будет дефект, а дефект приводит к ошибке.

<p>Но тут нужно понимать, что приручить его это еще пол беды. Прикормленный программист может еще пару десятков лет пребывать в мутноватой стадии "да, все конечно славно, но действительно ли она ТА САМАЯ или стоит подождать новую более продвинутую версию?" А поскольку, любая версия нет-нет, да и взывает нарекания пользователей, то в этом состоянии он может зависать бесконечно. Это у них, кстати, называется гордым словом – перфекционизм.
	<br>Знавала я одного человека, который 5 лет семье не мог стиралку купить по причине того, что идеальное соотношение цена-качество все никак не находилось.

<p><b>Часть III: Удивить</b>

<p>И вот на этой стадии, девочки, нужно его удивить. Именно с этого, как я выяснила, у программистов и начинается любовь.

<p>Нужно сделать что-то такое, что не логично и прекрасно одновременно, что выбьется из его алгоритма раз и навсегда, запечатлеваясь в системе как "чудо". В системах же бывают чудеса?

<p>Это только с первого взгляда кажется, что все дело в вашем терпении, понимании и отзывчивости. На самом деле все это умеют и их компьютеры - терпеть, понимать и отзываться. А делать чудо умеете только вы. Ну, и еда и теплые тапки - это, конечно, испокон веков.

<p>Поэтому надо сделать что-то такое... Я вот лично, подняла на каменистом пляже Турции плоскую круглую галечку килограмм на 5 весом, объявила ее лучшим в мире турецким сувениром, загрузила в рюкзачек и повезла домой. Медведа эта история поразила настолько, что он три года всем рассказывал, а потом вот женился.

<p><b>Часть IV: Прямо сказать</b>

<p>Ну и вот. А потом вы начинаете с ним жить. И все у вас вроде бы славно, с оговорками, некоторыми натяжками и непониманием со стороны подруг, но все же хорошо. Вы охриниеваете каждый день от его странности, но уже почти привыкли. Постепенно, и как-то на удивление безболезненно, смиряетесь с отсутствием цветов, эффектных поступков и показной романтики. Понимаете, что за отпуск, развлечения, выезды на свежий воздух и комфорт в доме отвечаете вы и только вы. А он вам, на удивление, за это благодарен. 

<p>Приняли, что приятные сюрпризы с его стороны могут быть только предсказуемые, а точнее строго раз в год на ваш день рожденья.
	<br>Смирились с тем, что на все дни праздники вам будут дарить гаджеты, гаджеты и ничего кроме гаджетов и нашли в этом свою прелесть. Оценили его скромную, но в то же время такую реальную повседневную заботу. Научились оставлять заявки на совместный досуг в саппорте на холодильнике (особо продвинутые, я знаю, шлют сразу в Outlook-органазайзер), а о "спонтанных поступках" уведомлять за три недели.
	<br>Перестали дарить ему лыжи, сертификаты на фото-курсы, кулинарные книги и бежевые свитерки – словом все то, что по идее должно обогатить его жизнь, и поняли, что он это сваливает в углу. С трудом, со слезами и руганью, но все же смирились, что работа важнее, но при этом нашли способ отрывать его от компа в случае чего...

<p>И вроде бы все хорошо, но замуж че-то не зовут. А вы ждете. А он не зовет. И не похоже, что собирается. Вопрос почему? Да потому что вы не заметили! А оно было.
	<br>Это я поняла, когда прочитала чей-то пост 103 факта о японцах. Я давно уже подозреваю, что программисты ближе всего по психотипу к японцам. А про японцев пишут следующее:

<p><a href="http://www.livejournal.ru/travel/themes/id/1724 53">53.Практически ни один японец не может сказать “я тебя люблю” в лицо объекту любви.
	<br>54. Те, кто могут, вызывают дикое уважение у других.
	<br>55. Японцы ужасно застенчивы и легко смущаются.
	<br>56. Это больше сегодня относится к более старшим поколениям, но – когда японец делает предложение, нормально сказать что-нибудь типа “не могла бы ты готовить мне суп?” или “ты можешь стирать мое белье?”, потому что иначе они стесняются.</a>

<p>Вот. Спрашивали у вас про суп или посуду? В отпуск звали? Поздравляю, это было оно. 

<p>Вы не поняли? А между тем, он считают, что предложение было реализовано, вы в раздумьях, и повторять его не нужно.

<p>Ждать «что б все как положено» - с антуражем, на колене, с кольцом и надрывной музыкой за кадром - бесполезно. Это все в программисткой системе ценностей находится там же, где розы, сюрпризы, мягкие игрушки и понимание женской логики - в графе «Темные ритуалы».

<p>Прошедшим летом подобное озарение посетило не одну меня – все-таки пост про 103 факта о японцах разошелся по интернету широко. Потому что, сразу три моих знакомых девушки, до этого тихо-мирно жившие со своими программистами по несколько лет, резко повыходили замуж. Причем со всеми плюшками – с лимузинами, платьями, постановочным танго, обширными фотосессиями и прочим. Думаете это мужики такое предложили?

<p>Просто после многих лет девушки все поняли, девические мечты отринули и прямо, безо всяких намеков и «незаметных подталкиваний к решению» оставили заявку в саппорте на холодильнике: «Своди меня в Загс. Это важно». А парни в общем-то и не против были, просто им никто не говорил, что надо.

<p>Дата: 2010-11-03 16:34

<p>Источник: http://users.livejournal.com/akme_/215070.html