{
	"dic": {
		"adeptx": {
			"page/dev/android/hard_reset']['header": "Восстановление системы в LG E-435 (Андроид) через ADB",
			"page/dev/android/hard_reset']['no_combination": "LG E-435 не имеет специальной комбинации клавиш для восстановления системы",
			"page/dev/android/hard_reset']['download": "Скринкаст в полном размере",
			"page/dev/android/hard_reset']['needed": "Сначала скачайте",
			"page/dev/android/hard_reset']['quallcom": "Драйвер Quallcom",
			"page/dev/android/hard_reset']['instructions": "Итак, как это сделать",
			"page/dev/android/hard_reset']['windows_x32": "Вам потребуется 32-ная Windows (возможно получится обойтись без нее, но у меня не получилось ни через линукс ни через 64-битную Windows 8.1)",
			"page/dev/android/hard_reset']['step_by_step": "
				<li>Установить драйвер (см. выше)
				<li>Разархивировать ADB. Скопируйте файлы AdbWinApi.dll и adb.exe в папку C:/Windows/System32
				<li>Выключите телефон и перейдите в Recovery Mode, зажав для этого одновременно кнопки Power (включение телефона) + регулятор громкости вверх. Клавиши нужно удерживать до появления логотипа LG.
				<li>Подключите телефон к компьютеру и подождите пока установятся все необходимые драйверы.
				<li>Откройте командную строку (щелчек правой кнопкой мыши по пуску).
				<li>Введите: <b>adb reboot recovery</b>
				<li>Телефон перезагрузится пару раз: сперва появится логотип LG, через некоторое время зеленый Андроид и спустя еще некоторое время снова логотип LG.
				<li>Дождитесь экрана приветствия.
				<li>Готово.",

			"page/dev/android/hard_reset']['hope": "Надеюсь это поможет... Спасибо.",
			
			"about_grinec_tk": "Студия Веб-Разработки и Программного обеспечения «Grinec» была основана (более или менее, в той или иной форме) в 2009 году. Мы - организация мотивированных и талантливых личностей, которые работают вместе для достижения различных общих целей. Что это за цели? Зависит от многого. У нас есть множество продуктов и начатых проектов. Большинство наших разработок бесплатны. Многими наработками мы поделились через открытый исходный код. Большинство из нас творят бесплатно в свое свободное время. Некоторые сотрудничают часто, другие занимают более пассивную роль, но всегда готовы помочь, когда они необходимы. Независимо от того, кто мы и что мы делаем - наша главная цель была, есть и всегда будет единственно важной: изменить мир к лучшему! Что нужно группе людей, работающих в основном в свое свободное время, чтобы сделать это? Самая малость: талант, страсть, воля и хорошие идеи. Все это есть у нас и даже больше. Кроме того, мы надеемся, что наша самоотверженность в погоне за качеством и знаниями не словом, а делом докажет чего мы стоим и более обеспеченные люди, которые разделяют наше мировоззрение, помогут нам тут и там. Мы же пока будем полагаться на благотворительность и небольшие рекламные сборы понемногу с разных уголков (мы не переносим навязчивой рекламы) и те некоторые платные продукты, которыми владеем. Мы не просто работаем с имеющимися технологими. Мы их создаем!",
			
			"compare": "Сравнить",
			"output": "Результат",
			"before": "До",
			"after": "После",
			"quickdiff']['main_text": "<h1>Онлайн инструмент быстрого сравнения и нахождения отличий в файлах или фрагментах текста</h1>
		<div>
		<a class=\"hideshow toggle\">Нажмите здесь, чтобы прочесть интрукции</a>
		<div id=\"how_to_use\">
		<p>Просто вставьте текст для сравнения в левое поле, а текст, с которым сравнивается первый фрагмент, в правое поле и нажмите кнопку \"Сравнить\", чтобы увидеть результат ниже.

		<p>На пути разработчика я постоянно сталкиваюсь с необходимостью нахождения различий между двумя частями текста.

		<p>Сейчас почти каждый IDE (и другие программы) имеют встроенные утилиты для сравнения текста (например <a href=\"http://www.eclipse.org\" target=\"eclipse\">Eclipse</a>),
		Но лично мне не удобно каждый раз при необходимости нахождения отличий в двух фрагментах кода создавать новые файлы и далее по алгоритму до получения результатов. Для того чтобы сравнить части кода онлайн достаточно просто вставить фрагменты кода в поля ниже и нажать кнопку.

		<p>Вот почему я сделал себе быструю онлайн-версию \"сравнителя\", которая доступна всем, кому это может пригодиться. (Отдельное спасибо Harmen Stoppels за вклад в разработку этого инструмента).

		<p>На данный момент добавлены следующие опции:
		<dl>
		  <dd>Игнорируются пробелы и табуляции в начале и конце каждой строки обоих частей текста</dd>
		  <dd>Игнорируются пустые строки в обоих частях текста</dd>
		  <dd>Если пробелы или табуляции встречаются более одного раза подряд, они принимаются за один отступ</dd>
		</dl>

		<p>Также я добавил несколько других опций для различных алгоритмов:
		<dl>
		  <dt>Бок-о-бок</dt>
		  <dd>Различия показываются в общем поле как один фрагмент</dd>
		  <dt>Строковый</dt>
		  <dd>Различия показываются построково при помощи Класса <a href=\"http://www.pear.php.net/package/Text_Diff\">Pear Diff Class</a></dd>
		</dl>

		<p>Для удобства сравнения очень длинных фрагментов я сделал идентичную форму с текстами снизу, чтобы не приходилось долго прокручивать.
		</div>
		</div>
		"
		
		}
	}
}