<hr>add hotkey Alt+K do_smthng_vs_args<hr>

Мы "типо" повесили выполнение команды "do_smthng_vs_args" на сочетание клавиш "Alt+K" (на самом деле это всего лишь заглушка)

<hr>select mail<hr>Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<table><tbody valign="top"><tr style="color:green"><td>Сочетание клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя скрипта</td><td>Параметры</td><td>Краткое описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<table><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px;}</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px;}</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px;}</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;}</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;}</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;}</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(0,0,0,0.5);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.25);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.15);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.5);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td>Сочетание&nbsp;клавиш</td><td>Действие</td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td>Имя&nbsp;скрипта</td><td>Параметры</td><td>Краткое&nbsp;описание</td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} </style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 80em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 52em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться. Первое, что следует знать, это список всех доступных для выполнения скриптов, он-то и приведён ниже с кратким, в двух словах, описанием примерного предназначения скрипта. Далее, зная имя скрипта, вам следует набрать команду "about $command_name" (без кавычек, где $command_name = имя скрипта) и вы увидите детальное описание того, что делает этот скрипт, для чего он предназначен и собственно синтаксис его использования. Далее просто используйте этот скрипт прямо как он есть, введя в полее ввода комманд или же вызывайте его в своих скриптах или программах. Как это делать будет описано позже. Итак, первое что вам сейчас необходимо сделать (и в дальнейшем всегда делать при запуске сисеты (открытии сайта, истечения срока дейтсвия сессий и т.п.) - это авторизоваться, чтобы продолжить дальнейшую работу. После авторизации вызовите это окно снова, чтобы увидеть перечень всех доступных вам команд, сейчас вы видите только список команд, доступных для всех. Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт. Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться на самом начальном этапе. Ниже приведён список самых основных команд, с кратким описанием предназначения скрипта. Чтобы унать больше о конкретной команде есть команда `about $command_name` (где $command_name = имя скрипта). Команды можно использовать в этой оболочке, а также вызывать в своих скриптах или программах. Для этого можно подлключать исполняемый файл команды в свои проекты через include_once/require_once (once, потому что там определяется функция, повторное обьявление которой приведет к ошибке) и затем вызвать функцию с соответствующим названием или же через встроенную команду run($command_name). Многие команды имеют синонимы для того, чтобы упростить запоминание и уменьшить количество ошибок при воде, однако рекомендуется всё же использовать действительно имя команд при вызове. Для начала работы, первое что можно сделать - зарегистрироваться: `reg $email $password`. Далее просто авторизовываться, когда это необходимо (открытии сайта на новом устройстве, истечения срока дейтсвия сессий и т.п.) для того чтобы вытянуть из базы данных информацию о сессии и всё что связано с персонализацией системы и получить больше возможностей для выполнения команд. Всё, что необходимо запомнить о сессии и вашем профиле будет записываться в базу данных по возможности или вы можете обращаться к базе данных вручную. Каждый пользователь получает в распоряжение свою собственную базу данных `adeptx_userdb_$user_id` с персональными таблицами и полный доступ к своей базе данных. Кроме того, предоставленный доступ к публичным базам данных позволяет обращаться к расшаренным таблицам и другим пользователям (по установленным правилам: только для чтения или чтение и запись...). Также дела обстоят и с файлами, каждый пользователь получает в распоряжение свою папку и так далее. Кроме того в вашем распоряжении общий репозиторий файлов и скриптов. После того, как вы авторизуетесь, вызовите это окно снова, чтобы увидеть перечень доступных вам команд, поскольку сейчас вы видите только список команд, доступных для всех посетителей, авторизованные пользователи имеют более широкий функционал. <em>Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт.</em> Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться на самом начальном этапе. Ниже приведён список самых основных команд, с кратким описанием предназначения скрипта. Чтобы унать больше о конкретной команде есть команда `about $command_name` (где $command_name = имя скрипта). Команды можно использовать в этой оболочке, а также вызывать в своих скриптах или программах. Для этого можно подлключать исполняемый файл команды в свои проекты через include_once/require_once (once, потому что там определяется функция, повторное обьявление которой приведет к ошибке) и затем вызвать функцию с соответствующим названием или же через встроенную команду run($command_name). Многие команды имеют синонимы для того, чтобы упростить запоминание и уменьшить количество ошибок при воде, однако рекомендуется всё же использовать действительно имя команд при вызове. Для начала работы, первое что можно сделать - зарегистрироваться: `reg $email $password`. Далее просто авторизовываться, когда это необходимо (открытии сайта на новом устройстве, истечения срока дейтсвия сессий и т.п.) для того чтобы вытянуть из базы данных информацию о сессии и всё что связано с персонализацией системы и получить больше возможностей для выполнения команд. Всё, что необходимо запомнить о сессии и вашем профиле будет записываться в базу данных по возможности или вы можете обращаться к базе данных вручную. Каждый пользователь получает в распоряжение свою собственную базу данных `adeptx_userdb_$user_id` с персональными таблицами и полный доступ к своей базе данных. Кроме того, предоставленный доступ к публичным базам данных позволяет обращаться к расшаренным таблицам и другим пользователям (по установленным правилам: только для чтения или чтение и запись...). Также дела обстоят и с файлами, каждый пользователь получает в распоряжение свою папку и так далее. Кроме того в вашем распоряжении общий репозиторий файлов и скриптов. После того, как вы авторизуетесь, вызовите это окно снова, чтобы увидеть перечень доступных вам команд, поскольку сейчас вы видите только список команд, доступных для всех посетителей, авторизованные пользователи имеют более широкий функционал. <em><b>Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт.</b></em> Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться на самом начальном этапе. Ниже приведён список самых основных команд, с кратким описанием предназначения скрипта. Чтобы унать больше о конкретной команде есть команда `about $command_name` (где $command_name = имя скрипта). Команды можно использовать в этой оболочке, а также вызывать в своих скриптах или программах. Для этого можно подлключать исполняемый файл команды в свои проекты через include_once/require_once (once, потому что там определяется функция, повторное обьявление которой приведет к ошибке) и затем вызвать функцию с соответствующим названием или же через встроенную команду run($command_name). Многие команды имеют синонимы для того, чтобы упростить запоминание и уменьшить количество ошибок при воде, однако рекомендуется всё же использовать действительно имя команд при вызове. Для начала работы, первое что можно сделать - зарегистрироваться: `reg $email $password`. Далее просто авторизовываться, когда это необходимо (открытии сайта на новом устройстве, истечения срока дейтсвия сессий и т.п.) для того чтобы вытянуть из базы данных информацию о сессии и всё что связано с персонализацией системы и получить больше возможностей для выполнения команд. Всё, что необходимо запомнить о сессии и вашем профиле будет записываться в базу данных по возможности или вы можете обращаться к базе данных вручную. Каждый пользователь получает в распоряжение свою собственную базу данных `adeptx_userdb_$user_id` с персональными таблицами и полный доступ к своей базе данных. Кроме того, предоставленный доступ к публичным базам данных позволяет обращаться к расшаренным таблицам и другим пользователям (по установленным правилам: только для чтения или чтение и запись...). Также дела обстоят и с файлами, каждый пользователь получает в распоряжение свою папку и так далее. Кроме того в вашем распоряжении общий репозиторий файлов и скриптов, вы можете добавлять в него свои удачные скрипты, выкладывая их в общий доступ, помогая другим своими разработками. Также для выполнения доступны многие команды linux-терминала, только все они отрабатывают исключительно в вашем рабочем каталоге. Пытаясь достучаться до каталогов более высокого уровня через ../ вы получите ошибку безопасности. Разумеется, при таком наборе функциональности, ни о какой безопасности не может идти и речи, так что обход этих ограничений доступен, но помните, что подобное поведение вредит другим пользователям, поэтому за проделки вы будете забанены с удалением всех ваших данных. Не забывайте делать бекапы своих данных и сохранять их в безопасном от уязвимостей месте, повышать разными средствами безопасность данных и делясь своими наработками в области безопасности данных со всеми. После того, как вы авторизуетесь, вызовите это окно снова, чтобы увидеть перечень доступных вам команд, поскольку сейчас вы видите только список команд, доступных для всех посетителей, авторизованные пользователи имеют более широкий функционал. <em><b>Будьте бдительны, учёт кавычек в строках пока не реализован, это значит что пробелы в параметрах пока что недопустимы ни в каком виде, если директория или файл содержит пробел в имени вам к нему не достучаться. Исключением являются только команды eval и shell. Эта задача стоит в числе самых первых к реализации, когда это будет добавлено это уведомление пропадёт.</b></em> Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>add hotkey Ctrl+C do_smt<hr>

Мы "типо" повесили выполнение команды "do_smt" на сочетание клавиш "Ctrl+C" (на самом деле это всего лишь заглушка)
<hr>add hotke_y Ctrl+C do_smt<hr>


<hr>add hotkey Ctrl + C do_smt<hr>

Мы "типо" повесили выполнение команды "+" на сочетание клавиш "Ctrl" (на самом деле это всего лишь заглушка)
<hr>add hotkey "Ctrl + C" do_smt<hr>

Мы "типо" повесили выполнение команды "do_smt" на сочетание клавиш "Ctrl + C" (на самом деле это всего лишь заглушка)
<hr>add hotkey "Ctrl + C" "do_smt vs args"<hr>

Мы "типо" повесили выполнение команды "do_smt vs args" на сочетание клавиш "Ctrl + C" (на самом деле это всего лишь заглушка)
<hr>add hotkey "Ctrl + C" "do_smt 'vs' args"<hr>

Мы "типо" повесили выполнение команды "do_smt 'vs' args" на сочетание клавиш "Ctrl + C" (на самом деле это всего лишь заглушка)
<hr>add hotkey "Ctrl + C" "do_smt \"vs\" args"<hr>

Мы "типо" повесили выполнение команды "do_smt \"vs\" args" на сочетание клавиш "Ctrl + C" (на самом деле это всего лишь заглушка)
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться на самом начальном этапе. Ниже приведён список самых основных команд, с кратким описанием предназначения скрипта. Чтобы унать больше о конкретной команде есть команда `about $command_name` (где $command_name = имя скрипта). Команды можно использовать в этой оболочке, а также вызывать в своих скриптах или программах. Для этого можно подлключать исполняемый файл команды в свои проекты через include_once/require_once (once, потому что там определяется функция, повторное обьявление которой приведет к ошибке) и затем вызвать функцию с соответствующим названием или же через встроенную команду run($command_name). Многие команды имеют синонимы для того, чтобы упростить запоминание и уменьшить количество ошибок при воде, однако рекомендуется всё же использовать действительно имя команд при вызове. Для начала работы, первое что можно сделать - зарегистрироваться: `reg $email $password`. Далее просто авторизовываться, когда это необходимо (открытии сайта на новом устройстве, истечения срока дейтсвия сессий и т.п.) для того чтобы вытянуть из базы данных информацию о сессии и всё что связано с персонализацией системы и получить больше возможностей для выполнения команд. Всё, что необходимо запомнить о сессии и вашем профиле будет записываться в базу данных по возможности или вы можете обращаться к базе данных вручную. Каждый пользователь получает в распоряжение свою собственную базу данных `adeptx_userdb_$user_id` с персональными таблицами и полный доступ к своей базе данных. Кроме того, предоставленный доступ к публичным базам данных позволяет обращаться к расшаренным таблицам и другим пользователям (по установленным правилам: только для чтения или чтение и запись...). Также дела обстоят и с файлами, каждый пользователь получает в распоряжение свою папку и так далее. Кроме того в вашем распоряжении общий репозиторий файлов и скриптов, вы можете добавлять в него свои удачные скрипты, выкладывая их в общий доступ, помогая другим своими разработками. Также для выполнения доступны многие команды linux-терминала, только все они отрабатывают исключительно в вашем рабочем каталоге. Пытаясь достучаться до каталогов более высокого уровня через ../ вы получите ошибку безопасности. Разумеется, при таком наборе функциональности, ни о какой безопасности не может идти и речи, так что обход этих ограничений доступен, но помните, что подобное поведение вредит другим пользователям, поэтому за проделки вы будете забанены с удалением всех ваших данных. Не забывайте делать бекапы своих данных и сохранять их в безопасном от уязвимостей месте, повышать разными средствами безопасность данных и делясь своими наработками в области безопасности данных со всеми. После того, как вы авторизуетесь, вызовите это окно снова, чтобы увидеть перечень доступных вам команд, поскольку сейчас вы видите только список команд, доступных для всех посетителей, авторизованные пользователи имеют более широкий функционал. <em><b>Будьте бдительны, в строках реализован только учёт двойных кавычек, ни одинарные ни обратные не учитываются как символы для объединения выражения, и строка не может завершаться эрканирующим символом перед кавычкой (\") даже если перед этим стоит символ экранирования (что-то вроде: "C:\\" не сработает, нужен хотя бы пробел в конце строки). Кроме того у eval и shell несколько специфическая интерпретация введённых команд, двойные кавычки могут чудесным образом вырезаться там, где это не должно происходить. Довести эти моменты до ума находится в первоочередных задачах, когда это произойдёт данное уведомление исчезнет.</b></em> Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться на самом начальном этапе. Ниже приведён список самых основных команд, с кратким описанием предназначения скрипта. Чтобы унать больше о конкретной команде есть команда `about $command_name` (где $command_name = имя скрипта). Команды можно использовать в этой оболочке, а также вызывать в своих скриптах или программах. Для этого можно подлключать исполняемый файл команды в свои проекты через include_once/require_once (once, потому что там определяется функция, повторное обьявление которой приведет к ошибке) и затем вызвать функцию с соответствующим названием или же через встроенную команду run($command_name). Многие команды имеют синонимы для того, чтобы упростить запоминание и уменьшить количество ошибок при воде, однако рекомендуется всё же использовать действительно имя команд при вызове. Для начала работы, первое что можно сделать - зарегистрироваться: `reg $email $password`. Далее просто авторизовываться, когда это необходимо (открытии сайта на новом устройстве, истечения срока дейтсвия сессий и т.п.) для того чтобы вытянуть из базы данных информацию о сессии и всё что связано с персонализацией системы и получить больше возможностей для выполнения команд. Всё, что необходимо запомнить о сессии и вашем профиле будет записываться в базу данных по возможности или вы можете обращаться к базе данных вручную. Каждый пользователь получает в распоряжение свою собственную базу данных `adeptx_userdb_$user_id` с персональными таблицами и полный доступ к своей базе данных. Кроме того, предоставленный доступ к публичным базам данных позволяет обращаться к расшаренным таблицам и другим пользователям (по установленным правилам: только для чтения или чтение и запись...). Также дела обстоят и с файлами, каждый пользователь получает в распоряжение свою папку и так далее. Кроме того в вашем распоряжении общий репозиторий файлов и скриптов, вы можете добавлять в него свои удачные скрипты, выкладывая их в общий доступ, помогая другим своими разработками. Также для выполнения доступны многие команды linux-терминала, только все они отрабатывают исключительно в вашем рабочем каталоге. Пытаясь достучаться до каталогов более высокого уровня через ../ вы получите ошибку безопасности. Разумеется, при таком наборе функциональности, ни о какой безопасности не может идти и речи, так что обход этих ограничений доступен, но помните, что подобное поведение вредит другим пользователям, поэтому за проделки вы будете забанены с удалением всех ваших данных. Не забывайте делать бекапы своих данных и сохранять их в безопасном от уязвимостей месте, повышать разными средствами безопасность данных и делясь своими наработками в области безопасности данных со всеми. После того, как вы авторизуетесь, вызовите это окно снова, чтобы увидеть перечень доступных вам команд, поскольку сейчас вы видите только список команд, доступных для всех посетителей, авторизованные пользователи имеют более широкий функционал. <em><b>Будьте бдительны, в строках реализован только учёт двойных кавычек, ни одинарные ни косые кавычки не учитываются как символы для объединения выражения, и строка не может завершаться эрканирующим символом перед кавычкой (\") даже если перед этим стоит символ экранирования (что-то вроде: "C:\\" не сработает, нужен хотя бы пробел в конце строки). Кроме того у eval и shell несколько специфическая интерпретация введённых команд, двойные кавычки могут чудесным образом вырезаться там, где это не должно происходить. Довести эти моменты до ума находится в первоочередных задачах, когда это произойдёт данное уведомление исчезнет.</b></em> Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>help<hr>

Добро пожаловать в Adeptx Driver! Этот туториал призван помочь вам сориентироваться на самом начальном этапе. Ниже приведён список самых основных команд, с кратким описанием предназначения скрипта. Чтобы унать больше о конкретной команде есть команда `about $command_name` (где $command_name = имя скрипта). Команды можно использовать в этой оболочке, а также вызывать в своих скриптах или программах. Для этого можно подлключать исполняемый файл команды в свои проекты через include_once/require_once (once, потому что там определяется функция, повторное обьявление которой приведет к ошибке) и затем вызвать функцию с соответствующим названием или же через встроенную команду run($command_name). Многие команды имеют синонимы для того, чтобы упростить запоминание и уменьшить количество ошибок при воде, однако рекомендуется всё же использовать действительно имя команд при вызове. Для начала работы, первое что можно сделать - зарегистрироваться: `reg $email $password`. Далее просто авторизовываться, когда это необходимо (открытии сайта на новом устройстве, истечения срока дейтсвия сессий и т.п.) для того чтобы вытянуть из базы данных информацию о сессии и всё что связано с персонализацией системы и получить больше возможностей для выполнения команд. Всё, что необходимо запомнить о сессии и вашем профиле будет записываться в базу данных по возможности или вы можете обращаться к базе данных вручную. Каждый пользователь получает в распоряжение свою собственную базу данных `adeptx_userdb_$user_id` с персональными таблицами и полный доступ к своей базе данных. Кроме того, предоставленный доступ к публичным базам данных позволяет обращаться к расшаренным таблицам и другим пользователям (по установленным правилам: только для чтения или чтение и запись...). Также дела обстоят и с файлами, каждый пользователь получает в распоряжение свою папку и так далее. Кроме того в вашем распоряжении общий репозиторий файлов и скриптов, вы можете добавлять в него свои удачные скрипты, выкладывая их в общий доступ, помогая другим своими разработками. Также для выполнения доступны многие команды linux-терминала, только все они отрабатывают исключительно в вашем рабочем каталоге. Пытаясь достучаться до каталогов более высокого уровня через ../ вы получите ошибку безопасности. Разумеется, при таком наборе функциональности, ни о какой безопасности не может идти и речи, так что обход этих ограничений доступен, но помните, что подобное поведение вредит другим пользователям, поэтому за проделки вы будете забанены с удалением всех ваших данных. Не забывайте делать бекапы своих данных и сохранять их в безопасном от уязвимостей месте, повышать разными средствами безопасность данных и делясь своими наработками в области безопасности данных со всеми. После того, как вы авторизуетесь, вызовите это окно снова, чтобы увидеть перечень доступных вам команд, поскольку сейчас вы видите только список команд, доступных для всех посетителей, авторизованные пользователи имеют более широкий функционал. <em><b>Будьте бдительны, в строках реализован только учёт двойных кавычек, ни одинарные ни косые кавычки не учитываются как символы для объединения выражения, и строка не может завершаться эрканирующим символом перед кавычкой (\") даже если перед этим стоит символ экранирования (что-то вроде: "C:\\" не сработает, нужен хотя бы пробел в конце строки). Кроме того у eval и shell несколько специфическая интерпретация введённых команд, двойные кавычки могут чудесным образом вырезаться там, где это не должно происходить. Довести эти моменты до ума находится в первоочередных задачах, когда это произойдёт данное уведомление исчезнет.</b></em> Приятной работы!

Перечень доступных клавиатурных сочетаний и горячих клавиш в этом окне:

<style>.help_table td {padding: 5px 10px;} .help_table tr:nth-child(2n) {background-color:rgba(255,255,255,0.05);} .help_table, .help_table * { box-sizing: border-box; } .help_table { max-width: 51em;
    box-sizing: border-box;
    font-size: 13px; }</style><table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Сочетание&nbsp;клавиш</b></td><td><b>Действие</b></td></tr><tr><td>Esc</td><td>Очистить экран и строку ввода команд</td></tr><tr><td>Ctrl + Enter</td><td>Показать/скрыть окно ввода команд в котором вы сейчас находитесь</td></tr><tr><td>Enter</td><td>Отправить команду на сервер для выполнения (POST)</td></tr><tr><td>Ctrl + H</td><td>Показать это руководство</td></tr></tbody></table>
Перечень всех доступных скриптов (в квадратных скобках указываются необязательные параметры):

<table class="help_table"><tbody valign="top"><tr style="color:green"><td><b>Имя&nbsp;скрипта</b></td><td><b>Параметры</b></td><td><b>Краткое&nbsp;описание</b></td></tr><tr><td>about</td><td>$command</td><td>Посмотреть справку по конкретному скрипту</td></tr><tr><td>aliases</td><td>$command</td><td>Посмотреть все возможные синонимы (алиасы) команды</td></tr><tr><td>auth</td><td>$email $pass</td><td>Авторизация в системе</td></tr><tr><td>exit</td><td></td><td>Обратный авторизации процесс, переход в режим стороннего наблюдателя (ghost-статус. Всего на сайте сейчас три статуса: ghost, staff, admin. Неавторизованные пользователи имеют статус ghost, авторизованные staff или admin, разница между которыми лишь в том, что admin может выполнять действия с профилями участников staff</td></tr><tr><td>help</td><td></td><td>Вызов этой справки</td></tr><tr><td>lang</td><td></td><td>Указать предпочтительный язык</td></tr><tr><td>reg</td><td>$email $pass</td><td>Регистрация нового пользователя</td></tr></tbody></table>
<hr>get my status<hr>

ghost
<hr>get my status<hr>

ghost
<hr>get my status<hr>

ghost
<hr>get my status<hr>

ghost
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>exit<hr>

$msg_exit_success
<hr>exit<hr>

$msg_exit_success
<hr>exit<hr>

$msg_exit_success
<hr>exit<hr>

$msg_exit_success
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>exit<hr>

$msg_exit_success
<hr>exit<hr>

$msg_exit_success
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>exit<hr>

$msg_exit_success
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>exit<hr>

$msg_exit_success
<hr>exit<hr>

$msg_exit_success
<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>hello<hr>

Добро пожаловать в Adeptx Driver! Для начала полноценной работы авторизуйтесь в системе (auth) или воспользуйтесь справкой (help).

P.S.: вы можете использовать команду hello для проверки того, авторизованы вы или нет (если вы аторизованы она обратиться к вам по нику, если нет - вы увидите это сообщение) или команду get my status, сейчас ваш статус ghost.

<hr>db gtre<hr>

Текущей БД выбрана база данных <strong style="color:lightgreen">gtre</strong>, узнать текущую БД: <strong><em>pwdb</em></strong>
<hr>pwdb<hr>

Текущим какталогом сейчас является gtre
<hr>cd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>cd ~<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx/user</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>get my status<hr>

ghost
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>ls<hr>

Содержимое текущей директории:

./README.md
./ajax/
./class/
./cmd/
./conf/
./css/
./db/
./extra/
./font/
./handler/
./html/
./img/
./index-2.php
./index.php
./index.php~
./js/
./lang/
./log/
./pma/
./robots.txt
./rout/
./setup/
./temp/
./theme/
./user/

<hr>ls<hr>

Содержимое текущей директории:

./add.php
./aliases.php
./auth.php
./cal.php
./cat.php
./cd.php
./check.php
./chmod.php
./copy.php
./create_backup.php
./date.php
./db.php
./download.php
./dump.php
./echo.php
./epigraph.php
./error.log.php
./eval (2).php
./eval.php
./exit.php
./fa.php
./filesize.php
./get.php
./head.php
./hello.php
./help (2).php
./help.php
./history
./history.php
./ii.php
./killallprocesses.php
./lang.php
./ls.php
./mail.php
./message.php
./more.php
./n.php
./names.php
./output.php
./pwd.php
./pwdb.php
./reg.php
./remove.php
./rename.php
./select.php
./set.php
./shell.php
./site.php
./source.php
./stable/
./symlink.php
./tail.php
./touch.php
./tree.php
./unreg.php
./unzip.php
./upload.php
./y.php
./zip.php

<hr>pwd<hr>

Текущим какталогом сейчас является /home/x-positive/srv/adeptx/cmd
<hr>./ls<hr>


<hr>cd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>cd cmd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx/cmd</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>./cd<hr>


<hr>pwd<hr>

Текущим какталогом сейчас является /home/x-positive/srv/adeptx/cmd
<hr>./cd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>cd cmd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx/cmd</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>./ls<hr>

Содержимое текущей директории:

./add.php
./aliases.php
./auth.php
./cal.php
./cat.php
./cd.php
./check.php
./chmod.php
./copy.php
./create_backup.php
./date.php
./db.php
./download.php
./dump.php
./echo.php
./epigraph.php
./error.log.php
./eval (2).php
./eval.php
./exit.php
./fa.php
./filesize.php
./get.php
./head.php
./hello.php
./help (2).php
./help.php
./history
./history.php
./ii.php
./killallprocesses.php
./lang.php
./ls.php
./mail.php
./message.php
./more.php
./n.php
./names.php
./output.php
./pwd.php
./pwdb.php
./reg.php
./remove.php
./rename.php
./select.php
./set.php
./shell.php
./site.php
./source.php
./stable/
./symlink.php
./tail.php
./touch.php
./tree.php
./unreg.php
./unzip.php
./upload.php
./y.php
./zip.php

<hr>cd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>cd ~<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx/user</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>cd<hr>

Текущий каталог изменён на <strong style="color:lightgreen">/home/x-positive/srv/adeptx</strong>, узнать текущий каталог: <strong><em>pwd</em></strong>
<hr>get my status<hr>

ghost
<hr>select mail<hr>

Последние непрочитанные сообщения (LIMIT 50):

Отправитель: #2 $from_nickname ($from_email)
Тема: Тестовое сообщение
Сообщение: Так будут выглядеть ваши новые непрочитанные сообщения когда вы зарегистрируетесь.<br>Это лишь один из многих мессенджеров, вы можете подключать любой мессенджер, в том числе писать свой собственный. <br>Как следствие темы оформления могут быть любыми, как и настройки считывания сообщений.
Дата: 2015-09-10 23:41:11

<hr>