<article class="txt">
<p>
Контакты
</p><p>
+7 (905) 213-46-62
<br>+7 (965) 775-50-44
<br>e.grinec@gmail.com
</p><p>
Образование
</p><p>
2014-2016		Магистр в области метаматериалов, Университет ИТМО, Санкт-Петербург, Россия
<br>2010-2014		Технический специалист в области электроники по направлению «Микро и наноэлектроника», Днепродзержинский государственный технический университет, Днепродзержинск, Украина
<br>Выпускная работа на степень бакалавра
 </p><p>
Тема					Проектирование биомедицинского аппарата
<br>Научные руководители		Багрий В.В., Гулеша О.Н.
<br>Описание				Расчет параметров и моделирование аппарата бесконтактной 							диагностики организма
</p><p>
Тезисы конференций
</p><p>
6. Гринец Е. Г., Жульковский О. А., «Создание программы для биомедицинского аппарата специального назначения», II тур Всеукраинского конкурса студенческих научных работ в отрасли «Информатика и кибернетика» в секции «Медицинская и биологическая информатика и кибернетика», 2014 г. 
<br>5. Гринец Е. Г., Гулеша О. Н., «Проектирование биомедицинского аппарата специального назначения», II тур Всеукраинского конкурса студенческих научных работ в отрасли «Электроника» в секции «Физическая и биомедицинская электроника», 2014 г. 
<br>4. Гринец Е. Г., Мещанинов С. К., «Био- и наносенсоры в современной медицине», Всеукраинский конкурс студенческих научных работ в отрасли «Радиотехника», 2013 г. 
<br>3. Гринец Е. Г., Багрий В. В., «Био- и нанотранзисторы», Всеукраинский конкурс студенческих научных работ в отрасли «Электроника и электромеханика», 2013 г. 
<br>2. Гринец Е. Г., Мещанинов С. К., «Миниатюризация сенсоров. Наносенсоры», Международный молодежный форум «Радиоэлектроника и молодежь в XXI веке», в секции «микро- и наноэлектроника”, 2012 г. 
<br>1. Гринец Е. Г., Мещанинов С. К., «Датчики и сенсоры в современности», Всеукраинская научно-практическая конференция студентов и молодых ученых «Молодая Академия-2012», 2012 г.
</p><p>
Компьютерные навыки
</p><p>
Linux Ubuntu 14.04/Microsoft Windows 8.1, Microsoft Office 2013/LibreOffice.
</p><p>
Вычисления в MathCAD, работа с изображениями и шаблонами в Adobe Photoshop CC и Adobe Illustrator CC, проектирование в AutoCAD, моделирование в CST Microwave Studio, создание принципиальных схем в Multisim 11 и Microcap 8, создание макетов печатных плат в SprintLayout.
Backend (Middle Web Developer): nginx/apache + MySQL + PHP, cron, парсинг данных (в т.ч. в больших объемах, в т.ч. используя curl и cookie для авторизованного доступа), использование API сторонних сайтов (подключение платежных систем, СМС и e-mail оповещений, vk, google, webmoney, etc), frontend (CSS 3, HTML5, JavaScript, jQuery, ajax, json), верстаю под последние версии Firefox, Chrome, Opera, Safari (однако и про кроссбраузерность не забываю).
</p><p>
Имею представление об оптимизации, работы с кэшем, http-заголовками.
</p><p>
Быстро осваиваю языки, библиотеки, технологии, понимаю ООП, осведомлен о SEO.
</p><p>
Создание сайтов и интернет магазинов на CMS (modx, webasyst, opencart, wordpress, drupal, joomla, bitrix, virtuemart, vamshop). Среди моих работ:
</p><p>
kasko-kupit-v-spb.ru (разработка калькуляторов расчета стоимости страховки, слайдеров, обработчиков форм, навигаторов и прочих динамических частей, активное участие в оформлении)
<br>gameover.com.ua (разработка сложного парсера [параллельный парсинг с нескольких сайтов, фильтрация])
<br>wuzazu.com (разработка и верстка на opencart по .psd макету)
<br>eatinyat.com (разработка и верстка на modx по .ai макету)
<br>zookomplekt.ru (разработка с нуля на webasyst, перенос товарных позиций с сайта поставщика (пасинг), 
<br>biser-klass.moy.su (разработка с нуля на ucoz согласно всем желаниям заказчика)
<br>справки-все.рф (разработка с нуля на wordpress по .psd макету)
<br>…и множество подобного рода разношерстных и не очень заказов, а также тьма всяких сайтов-визиток вроде elenakiseleva.ru и мелких продающих сайтов, различных функциональных элементов к сайтам – слайдеров, галерей, парсеров, форм, мультиаплоадеров, админок, калькуляторов и прочее.
</p><p>
Бонус: C && C++ && основы perl && Java Junior Developer (самообучение, разнообразные эксперименты из интересного: свой бот, управляющий компьютером при помощи симуляции действий мыши и клавиатуры и выполняющий определенные алгоритмы).
</p><p>
Прочие навыки
</p><p>
Ручная травка и изготовление печатных плат (ЛУТ), обучаюсь программированию (прошивке) микроконтроллеров
</p><p>
Черты характера / личностные качества
</p><p>
Аналитический склад ума, упорство, фанатизм, уверенность, гибкость мышления (легкообучаемость )
</p><p>
Владение языками: русский и украинский (родные), английский (intermediate)
</p><p>
Научные интересы: метаматериалы, наноэлектроника, IoT, физиология, искусственный интеллект, электроника сверхмалых размеров, оптические системы хранения, обработки и передачи данных, технологии будущего
</p><p>
Членство в сообществах: студенческое членство в SPIE, активный участник сообщества фрилансеров (fl.ru), подписан на Habrahabr, Geektimes, Forbes, Популярную механику  И вообще увлекаюсь футуризмом и как следствие всеми новейшими и будущими технологиями.
</p><p>
Цель
</p><p>
Я претендую именно на стажировку, начальный уровень, должность «юниор веб-разработчик», чтобы в полной мере применять свои навыки и умения, не имея, с другой стороны, за плечами длительного опыта в работе на офисе или в компании. Чтобы получить возможностью развития, роста, обучения и приобретения опыта. Стремлюсь примкнуть к людям со всегда свежим подходом, актуальной направленностью и средствами разработки.
Моя цель – получить опыт применения своих навыков и умений, расширить базу знаний, развить способности, максимально эффективно и выгодно их применяя, подновить свой инструментарий и техники, обменяться опытом. Даже если на данный момент компании не требуются стажеры, специализирующиеся в данной области, они непременно потребуются. Уверен, перед компанией впереди еще очень много задач в области моих интересов, которые предстоит решить
</p><p>
Давненько я хотел перейти к участию в разработке более серьезных проектов, чтобы подняться на новый этап, набирая опыт и портфолио. Однако в мире, который каждый день меняется стремительным потоком, я нахожу опрометчивостью менять рабочее место каждый месяц, предпочитая сразу стремиться примкнуть к тому, что близко по душе. Пусть портфолио пока не блестящее, пора набираться опыта несамостоятельной работы. А если моих знаний для начала не хватит, то всегда есть возможность исправить эту ситуацию обучением.
</p><p>
Я активный, целеустремленный, самостоятельный и с легкостью и радостью обучаюсь. Всегда открыт к новшествам и креативу. Гонюсь не только за легкими деньгами, а в первую очередь к наилучшему результату. Что поделать, перфекционист я по натуре, самокритично отношусь к выполнению своей любимой работы:)
</p><p>
Имею кладовочку интереснейших идей, которые просто-таки необходимо реализовать. Горю желанием развить свои амбициозные идеи в стартап. Помимо новых проектов, очень часто появляются идеи по модернизации сервисов, услугами которых пользуюсь, а значит какой-то толк во мне сокрыт, во всяком случае, проверить необходимо:)
</p>
</article>