<?
# Здесь пользователь может полностью в удобном формате настраивать CSS стили своего сайта
# Сами уникальные идентификаторы и классы создаются в шаблонизаторе, здесь можно только выбирать из созданных и применять к ним стили. Можно вводить в поле с автодопонением, можно автоматически генерировать, можно писать русские идентификаторы и транслитерировать

# Для стилей, которые указываются через запятые создаются переменные, которые используются дя автогенерации CSS файла
?>
<tr><td>Уникальный идентификатор:</td><td>
<select>
	<option>#id1</option>
	<option>#id2</option>
	<option>...</option>
</select>
</td></tr>
<tr><td>Классы:</td><td>
<select>
	<option>.class1</option>
	<option>.class2</option>
	<option>...</option>
</select>
</td></tr>
<tr><td>Тип обьекта (tag):</td><td>
<select>
	<option>Блок (div)</option>
	<option>Параграф (p)</option>
	<option>...</option>
</select>
</td></tr>
<tr><td>Атрибуты:</td><td><input></td></tr>
<tr><td>Опции:</td><td><checkbox>Заблокированные</checkbox></td></tr>

<tr><td>Родительский элемент:</td><td>
...
</td></tr>