<p>Путь разработчика проходит, если упростить, примерно через такие этапы:
	
<p>1. Как это работает? Как мне изменить работу этого или создать нечто похожее?
	
<p>2. После этих вопросов человек учится и сперва изучает само программирование, разбираясь что в нем к чему, затем изучает какой-то конкретный язык, затем учится его применять
	
<p>Затем он изучает разные технологии и теники. Паралельно он учится английскому, потому что все программирование по сути держиться на аглийском.
	
<p>Затем ему нужны деньги, что бы подолжать обучение, иначе загнется с голода. Прошло ведь несколько лет обучения. Пора зарабатывать деньги. Они ищет кого-нибудь, кто воспользуется свои услуги. Так он становится сперва фрилансером, а дальше больше.
	
<p>И много ее других этапов.
	
<p>Что предлагает Adeptx:
	
<p>1. Как это работает? Как мне изменить работу этого или создать нечто похожее?
<p>2. Воспльзуйтесь adeptx.lazy. На родном для вас языке. Вы можете сделать все, что можно сдлать на php, html5, css, mysql, javascript. Вам ничего не надо знать об этих технологиях.
<p>3. Повышая свои навыки и умения, переходите с adeptx.lazy на adeptx.ordinary, adeptx.indigo а затем и на adeptx.god.