ПОМНИ ПРО ПОРТФЕЛЬ ПРОЕКТОВ ВЕНЧУРНОГО ФОНДА

<h1>Adeptx</h1>

<div><em>“The world is but a canvas to our imagination”</em></div>

<div><em>— Henry David Thoreau</em></div>

<h2>Что такое Adeptx Sky</h2>

<p>Cloud CMS system with selfupdating, repository, pool, user pool and many other.

<p>Adeptx Tool Kit — это комплексная операционная система в интернете. Если откинуть все преимущества Adeptx, то можно назвать Adeptx CMS - системой управления контентом, упрощающей создание сайта, однако это значительное упрощение, сильно искажающее суть проекта. Здесь вы найдете не просто управление контентом сайта, но вы получаете полностью функциональную операционную систему в самом широком смысле этого слова. В этой системе вы получаете все возможности стандартных операционных систем, необходимый интрументарий для создания программ, плагинов модулей и сайтов и систему управления всм этим.

<h2>Для кого Adeptx Sky</h2>

<p>В первую очередь, мы создавали Adeptx для себя. Мы - разработчики, которые постоянно трудятся над тем, чтобы делать сайты лучше, быстрее и функциональнее. Системный подход значительно расширил наши возможности и позволил значительно упростить разработку. Если вы просто хотите создать себе сайт или выполнить чей-то заказ - это, скорее всего, не для вас. Adeptx Sky создан для веб-студий создающих сайты и проект на своем хостинге и предоставляющим своим клиентам обслуживание. Если вы не представитель студии и тем более если вы не веб-разработчик, это не для вас, но вы можете обратится за разработкой сайта к любой из таких студий по вашему вкусу. Ведь эта система создана именно для того, чтобы они могли выполнять вас заказы и создавать вам сайты по вашему вкусу.

<h2>Как работает Adeptx Sky</h2>

<p>
<ol>
	<li>Вы устанавливаете Adeptx на свой хостинг или оплачиваете место прямо на нашей платформе.
	<li>Каждый созданный проект существует независимо от остальных и на разных доменах запускаются разные сайты.
	<li>Управляются эти сайты через единый интерфейс, нет нужды покидать рабочее пространство переходя от хостинга к хостингу.
	<li>Тем не менее права доступа настраиваются вами и вы сами определяете, какой доступ кому из сотрудников предоставить.
	<li>К созданному проекту можно подключать из репозитория любой из созданных плагинов, модулей, виджетов и выбирать темы дизайна, шрифты, скрипты и прочее.
	<li>Если необходимого плагина ещё нет, вы можете создать его и позднее использовать в любом другом проекте или сделать его доступным для остальных, чтобы они также могли использовать его из репозитория в своих проектах.
	<li>Вы получаете базу зарегистрированных пользователей, которые регистрировались ранее на любом из сайтов системы. Вы не получаете никакую личную информацию, однако если пользователь посетит ваш сайт и проявит желание преоставить свою информацию вам (читайте зарегистрироваться), у него не будет необходимости указывать всю информацию повторно, необходимая о нем информация может быть предоставлена вам по его решению.
	<li>Система наточена под автоматизацию, это значит, что все действия требуют минимального вмешательства. Для большинства действий достаточно просто кликнуть мышью в нужном месте. Нужные плагины установятся, вы можете поменять их порядок, настроить отображение, сменить дизайн или настройки.
</ol>

<h2>Информация для инвесторов</h2>

<p>Мы будем признательны каждому, кто хочет помочь проекту и мы всегда открыты для помощи. Что касается инвестиций, то на данном этапе мы очень нуждаемся в них, однако чтобы не стоял вопрос, откуда будут идти деньги, мы прямо распишем свой бизнес план, чтобы вы могли ознакомится

<h2>Расходы</h2>

<p>Регистрация ООО = 4000 руб. на оплату гос. пошлины

<p>Планируемые расходы:

<p>Хостинг: 400 руб./мес. * 12 мес. ~= 4 800 руб./год
VPS: 500-1000 рублей в месяц первое время (пока будет хватать 4.8Ghz процессора, 2Gb ОЗУ, 40Gb HD, 2000Gb трафика), пока нагрузка не будет выше 300-500 пользователей в день этого должно хватать с лихвой, а дальше растущие расходы уже окупаются за счет клиентов и добровольныз пожертвований проекту)
(имеются ввиду расходы, которые вырастут до 4000 руб./мес. для характеристик: 
Процессор: 19.2Ghz
ОЗУ: 8Gb
Место на диске: 160Gb
Трафик: 8000Gb)
Чего хватит на гораздо более длительный срок и более серьезные нагрузки.

Или jelastic cloud за 400 - 1500 р./мес. (сумма примерно та же)
До 1000 руб./мес. * 12 мес. = до 12 000 руб./год

<p>В этих видах расходов удобно то, что расходы увеличиваются по мере увеличения нагрузки, которая, в свою очередь, увличивается по мере поступления клиентов, а следовательно и продаж, которые будут эти расходы покупать.

<p>Расходы на команду:

<p>Необходимы сотрудники:

<br>Веб-разработчик: 60-80 тыс. рублей/мес. (возможно удаленное сотрудничество, я с братом это уже два готовых веб-разработчика)
<br>Верстальщик: 40-60 тыс. руб./мес. (первое время мы с братом можем заниматься также этой частью)
<br>Веб-дизайнер: 40-60 тыс. рублей/мес.
<br>PR-менеджер: 60-80 тыс. руб./мес.
<br>SEO-специалист: 40-60 тыс. руб./мес.
<br>Проектировщик архитектуры / ООП специалист: 60-80 тыс. рублей/мес.
<br>кроме того первое время можнопользоваться услугами фрилансеров в тех или иных областях или я могу обратится к знакомым разработчикам.

<p>Итого до 350 тыс. руб./мес. * 12 мес. = до 4 000 000 руб./год (отсюда вычтется время на поиск и первое время нет необходимости во всей команде, впрочем, чем больше будет разработчиков, тем быстрее будет разработка). При найме фрилансеров для решения определенных задач, оплата штата также может быть несколько ниже.

<p>Для каждой веб-студии предлагается личное пространство для создания сайтов за отдельную плату, зависящую от количества ресурсов (разные модели стоят по разному, но суть сводится к оплате расходов на содержание хостинга и VPS сервера)

<p>Офис: от 15 000 руб./мес. (20 кв.м.) * минимум 12 мес. = от 180 000 руб./год

<p>5-7 рабочих вычислительных машины для сотрудников (ноутбуки-компьтеры) пригодных для качественого выполнения работы, от 20 000 руб./шт. = от 100 000 руб.

<p>Содержание офиса в чистоте, кофе и печеньки от 1000 руб./мес. = от 12 000 руб./год

<p>Расходы на рекламу в интернете и PR от 10 000 руб./мес. = от 120 000 руб./год

<p>Таким образом, для работы в течении первого года и выхода на окупаемость и прибыльность необходимо потратить в первый год 17 000 + 4 000 000 + 180 000 + 100 000 + 12 000 + 120 000 = от 5 430 000 руб. на год (с допущениями в большую сторону в размере 100% (офис можно взять вдвое дороже, рекламу делать вдвое дороже, ЭВМ двое дороже и так далее)) или около 100 000 $ на первый год работы. Далеко не миллион долларов, однако этого хватит для успешного запуска стартапа и раскачивания в течении года, постепенного роста, набора сотрудников, открытия офиса, регистрации домена, хостинга, создания продукта, годного для выхода на рынок, рекламы, продвижения и так далее.

Таким образом, $100 000 - минимально необходимая проекту сумма и потому получив её 10% компании достанется инвестору. 50% этой суммы не стоят, ей потребуется не менее $ 1 млн. в таком случае.

<h2>Доходы</h2>

<p>Источниками прибыли является:
<ol>
	<li><strong>Предоставление облака как сервиса (100-1500 руб./мес. с компании-клиента, которые воспользуются услугами)
	<li>5% от суммы заказа, выполненного через сервис заявки на работы (сайты могут стоит 5000 - 50 000 рублей, так что в среднем 700 рублей за сайт, ТЗ на который было опубликовано на сайте)
	<li>За купленные экземпляры кода (от 1 000 руб. единоразово или от 100 р./мес. за версию с автообновлением, в качестве сервиса (первую неделю бесплатно или первый месяц, если заказ на нашем хостинге (в нашем облаке))), по мере развития и совершенствования системы цена поднимется, когда система будет в презентабельном качественно выполненном виде</strong>
	<li>Конекстная реклама на сайте + 100 руб. единоразово за подключения рекламы на сайтах, созданных через систему (клиенту предлагается 50% прибыли от доходов с рекламы (сумма предлагается в цифрах, а не процентах))
	<li>Платные плагины и модули также формируют прибыль
	<li>Добровольные пожертвования проекту (от 0 руб.)
	<li>Хаб (служба поддержки как сервис) от 500 рублей единовременно или от 50 руб./мес. + столько же для подлючения этой же службы к сайту клиента, для предоставления справок клиентам
	<li>3000 руб. за массовые рассылки сообщений или подключение СМС
	<li>Наша команда также может по запросу создавать клиентам сайты, формируя дополнительный бюджет (скажем, если поступит заказ на 20 000 рублей и есть возможность создать его на нашей системе за несколько дней, это будет дополнительный бонус), если прибыль перевешивает времезатраты и создание не будет мешать основной работе над сайтов, а напротив, поможет лучшему развитию системы
</ol>

<p>Проект масштабируемый и конкурентноспособный, с целевой аудиторией в виде веб-студий и частных веб-разработчиков (фрилансеров).

<p><strong>Целевая аудитория</strong>: разработчики сайтов, веб-студии, фрилансеры, дизайнеры, а также бизнесмены, которые хотят открыть интернет магазин или сайт компании. Минорную часть доходов составляют также люди, желающие открыть личный веб-сайт, сайт-визитку или лендинг, однако благодаря количеству этот пункт также может составлять не малую долику ЦА по прибыльности.

<p><strong>Команда</strong>: на данный момент команда состоит из меня - веб-разработчик, но также занимаюсь версткой, оптимизацией и даже немного дизайном, моего брата, который отлично дополяет меня в этих областях, моего хорошего друга, тоже веб-разработчика, тоже имеющего некоторые другие навыки (однако оба они в Украине, но мы отлино сотрудничаем вместе удаленно и имеем для этого прекрасные инструменты вроде Floobits для Sublime Text 3 и Teamviewer) и одногруппницы-программиста, которая занимается серверной частью, софтверной и так далее, она находится в СПб, поэтому мы можем встречаться с ней лично, однако удобнее всегда все равно сотрудничать удаленно, нежели где-нибудь в университете или других местах, не очень предназначенных под совместную работу над проектом. Вместе с моим братом и другом мы занимаемся разработкой очень давно, мы занимались и самообучением, и фрилансом, и поработали в компаниях, перепробовали множество разных инструментов для создания сайтов и выделили важные элементы. Мы пришли к этому проекту в первую очередь не потому, что нужна своя фирма, а потому, что мы создаем продукт, которого еще нет на рынке и в котором рынок нуждается, поскольку мы сами нуждались в таком продукте, нам не просто не хватало такого инструмента, но и из существующих инструментов, путем их модификаций все равно не удастся создать необходимый нам инструмент. Мы много обдумывали возможности, которых не хватает, что необходимо и так мы и начали разрабатывать этот проект. Что касается одногруппницы, то у неё свой богатый опыт в работе с серверами, она и сис.админом была и этот опыт нами очень ценится. А кого не хватает проекту я обозначил выше. Необходимые люди понадобятся не сразу, по мере необходимости их необходимо будет нанимать.

<p><strong>Уникальность продукта</strong> заключается в том, что на рынке веб-разработки сейчас царит хаос, каждый создает свои системы сам, по своим принципам и правилам и в дальнейшем не возвращаясь к созданным раннее сайтам, хотя код устаревает. Мы предоставляем автообновление кода ядра, встроенного в продукт, благодаря чему код не будет устаревать, как бы давно не был создан сайт, а для его редактирования создается упрощенная панель управления, позволяющая редактировать все на сайте простыми кликами. Также присутствует репозиторий для плагинов, шаблонов, тем дизайнов и прочего, что позволяет использовать созданные другими плагинами. Пользовательская база едина для всех сайтов системы, что позволяет значительно упростить регистрацию и авторизации пользователей внутри сайтов, созданных через систему. При желании создателей они также могут предоставлять свои продукты в общий пул, для продажи их на других сайтах системы в смежных категориях. Помимо прочего, для функциональных сайтов, которые предоставляют пользователям возможности использования различных программ (плеер, заметки, календарь и прочее) предоставляется возможность использования общего ПО внутри системы, также через репозиторий, с гибкой настройкой дизайнов и тем через панель управления.

<p>Рынок представляет собой ростущий рынок предоставления услуг в области создания сайтов.

<p>Проекты, немногим отдаленно напоминающие своей моделью создаваемый проект: Webasyst (с продуктом ShopScript 5), Adeptx испытывает значительное влияние ОС Linux, особенно в части архитектуры, а также повлияли системы CMS modx, wordpress, joomla, opencart.
Проект не просто испытал влияние всех этих систем, но впитал в себя все лучшее от них, полностью поменял это на лучшую реализацию и добавил свои уникальные моменты. Учитывая, что описанные системы развивались годами, но в них по прежнему высокий уровень старых решений, которые сприменением новых технологий можно решить гораздо эффективнее, то наш проект идет в ногу со временем, в отличие от них. К тому же, мы предоставляем клиентам серсис, который они могут предоставить в сво очередь своим клиентам, а не просто сбрасываем человеку бесплатный продукт для использования, что гораздо удобнее и эффективнее. И еще, по задумке, каждый клиент, в силу того, что ЦА - веб-студии и разработчики, создавая сайты на нашей системе, помогают развивать и систему и плагины к ней и темы и потому активно подключаются к разработке. Поэтому наше сотрудничество взаимовыгодно, мы поучаем внештатных сотрудников, которые получают хороший, масштабируемый инструмент для работы с удобной монетизацией их работ. Развитие проекта, таким образом, будет постоянным, будут все время включаться новые решения, создаваться новые возможности, программы и при реализации новых, прежде не созданных возможностей, в дальнейшем каждый может их использовать повторно. 

Выход на рынок: первоначальную информацию о проекте можно разместить на крупных информационных сайтах, вроде Habrahabr.ru, тогда о нём в короткое время узнает большая аудитория, состоящая преимущественно из ЦА. Далее контекстная реклама Яндекса поможет разместить и распространить информацию в рунете в больших объемах обнаружения. К тому же поисковая оптимизация и раскрутка, для того, чтобы по запросам создать сайт, как создать, на чем создать и так далее приводили пользователей к описанию нашего решения.

<h2>Недостатки и риски</h2>

<p>Риски связаны исключительно с невостребованностью продукта, однако согласно анализу рынка, целевой аудитории и возможностей, при правильно организованном распространении сведений о продукте и при успешном создании продукта, с осуществлением задуманного, продукт будет востребован и рынок для него уже сформирован и нуждается в подобных решениях (все веб студии используют сторонние наработки кода, плагины, CMS и также стремятся их улучшить "под себя" и развивать, чтобы избавится от множества недостатков)
Что касается недостатков такого подхода, то главный недостаток, это потеря клиента, если тот купит код и уйдет на свой хостинг, мы теряем дополнительный доход, который мог формироваться им при закахе доп. услуг и плагинов. Если же заказ сделан на нашем хостинге мы получаем дополнительный доход от всех последующих операций.
Второй недостаток, это нераспространенность продукта. Это звучит глупо, поскольку продукт новый, но в сфере веб-индустрии это все же именно недостаток, потому что чем больше людей использует систему, тем больше люди стремятся созавать под неё плагины, развивать систему и создавать на ней сайты. С другой стороны, если создать адаптер для плагинов под сторонние системы, такие как Wordpress, мы можем значительно увеличить количество пригодных для исользования плагинов и значительно расширить лояльность. К тому же интуитивный интерфейс, простота и функциональность, а также хорошая техническая документация способны свести на минимум влияние этого фактора.
Третий недостаток это нагрузки. К сожалению, все планы при их полной реализации создают достаточно высокую нагрузку на сервера. Выход из этой ситуации я вижу в облачной реализации структуры, в таком подходе нагрузка будет равномерно распределятся между пользователями, сильно нагружающими систему, между крупными студиями с большими проектами и сайтами с малой нагрузкой, одностраничниками и визитками. К тому же можно ввести доп. плату за большие нагрузки на систему и провести ряд оптимизационных мер для уменьшения нагрузок.

<h2>Преимущества</h2>

Автообновления кода ядра
Репозиторий плагинов, тем, шаблонов, модулей и программ
Автовалидация кода и пбезопасность
Новизна продукта. На данный момент на рынке сложилась ситуация, когда существующие CMS системы не способны удовлетворять астущие потребности рынка, разработчики находятся в активном поиске новых решений, стремятся развивать системы и расширять под разные нужны. Веб-студии растут и им необходима система управления созданными сайтами, объединяющая все созданные ими сайты одном месте.
Единая база клиентов
Общий пул проектов, продуктов, услуг
Пронизывающая полуавтоматическа служба тех. поддержки
MVC модель, полностью ajax-ориентированный подход (расширяемость, модульность, скорость и простота)
Гибкое управление уровнями доступа панели управления
100% настраиваемость создаваемых сайтов через панель без необходимости доступа к хостингу и БД
с возможностью сброса на настройки по умолчанию и настроек для каждого пользователя под себя
Система бекап-сохранения настроек, тем, редактируемых файлов и пользовательских данных
Отделенность ядра системы от пользовательской части, что является гарантом невмештельства пользователя в работу системы, что повышает её надежность, позволяет сделать автообновление для системы, что в свю очередь является гарантом того, что обнаруженные уявзимости и баги исправляясь единожды будут пофиксены на всех созданных на системе в прошлом сайтах.
Редакторы кода, плагинов, настроек, языковых модулей, роутеров, редакторы пакетов, автоматическая статистика, инсталяторы и деинсталяторы пакетов, командная строка и многие другие примочки.

<h2>Устройство Adeptx Eosy</h2>

<p>На данный момент в мире более миллиарда устройств с установленными операционными системами. Каждый раз покупая новое устройства мы снова устанавливаем операционную систему и все сопутствующее програмное обеспечение. Более того, в случае поломки, необходимо устанавливать все ПО заново. В случае переустановки ОС, снова устанавливать ПО. И так далее. В среднем более 100 Гб ПО на одном компьютере, которое необходимо устанавливать и переустанавливать. Мы решили, что это плохой тон. И потому мы придумали новый способ создания ОС. Мы решили, что достаточно 1 копии каждой версии ОС и 1 копии каждой версии любой программы установленных на сервере, а при покупке устройства достаточно просто подключиться к серверу и исползовать любую программу, установленную на сервере. При этом нет необзодимости устанавливать программы, достаточно просто выбрать, какие программы вы будете использовать, и использовать их. При этом вы надежно защищены от вирусов на своем устройстве, потому что ПО даже не устанавливается на ваш компьютер, все программы запускаются прямо на сервере, вы видите только результат их исполнения.

<p>Что касается различный ОС и программ, то их поддержка выполняется в виде событий мыши и клавиатуры, которые передаются серверу, а сервер возвращает ответ в виде изображения. Так можно выполнить большую часть программного обеспечения комьютера, на самом компьютере будет необходимость только в драйверах для I/O устройств и прочего железа.

<p>Что же касается собственной операционной системы Adeptx, то для неё нет необходимости передавать большие объемы изобращений для перерисовки всего экрана (или его области), при возникновении событий на сервер посылаются события от пользователя и генерируется код ответа, который будет выполнен на стороне клиента (javascript, с данными из БД MySQL, с HTML и CSS кодом или же изображениями для canvas-приложений)

<h2>Недостатки</h2>

<ol>
	<li>Полная зависимость от интернет-подключения. Если интернета нет, то компьютер превращается почти в кирпич. Зато при наличии постоянного безлимитного интернет-подключения система становится намного функциональнее и быстрее любого устройства.
	<li>Высокая нагрузка на сервер. Компенсируется большим количеством ПО, которое доступно для исполнения, в том числе лицензированного, лицензии для которого покупаются
</ol>

<?
/*
Senior Web Developer (PHP + MySQL, парсинг) 
Адаптивная кроссбраузерная верстка 
Веб-дизайн: JavaScript (ajax), HTML5, CSS3, jQuery, Photoshop CC, Illustrator CC 

Доп. навыки: Pascal, C++, Java 
Языки: RU <-> EN <-> UA 
Фреймворки и CMS: собственной разработки и opencart, bitrix, wordpress, joomla, virtuemart, drupal, modx, webasyst, shopscript 5 

прочие теги: linux, ubuntu, java, ajax, jquery, html5, css3, cron, sublime, floobits, phpmyadmin, php-fpm, nginx


wuzazu.com 500 $, 7 дней  	
Редактировать
2.	bazaoptiki.ru 500 $, 7 дней  	
Редактировать
3.	kasko-kupit-v-spb.ru 700 $, 14 дней  	
Редактировать
4.	eatinyat.com 500 $, 7 дней  	
Редактировать
5.	biser-klass.moy.su 200 $, 3 дня  	
Редактировать
6.	zookomplekt.host.webasyst.ru 500 $, 7 дней  


+ Добавить работу
1.	Создание с нуля и заполнение контентом сайтов 200 $, 7 дней  	
Редактировать
2.	парсер страниц, доступных только авторизованным пользователям 50 $, 3 дня  	
Редактировать
3.	подключение e-mail оповещений к сайту 30 $  	
Редактировать
4.	подключение SMS информирования к сайту 50 $  	
Редактировать
5.	создание разнообразных форм авторизации, регистрации и заказа товаров 20 $  	
Редактировать
6.	логотипы, слайдшоу, фотографии 30 $  	
Редактировать
7.	оформление хостинга, домена, перенос сайта на другой хостинг/домен 40 $  	
Редактировать
8.	качественный рерайт, копирайт, зазывающий (продающий) текст, наполнение сайтов контентом  	
Редактировать
9.	исправление ошибок скриптов, установка скриптов сторонних разработчиков  	
Редактировать
10.	кросс-браузерная вёрстка, адаптивно, пиксель в пиксель 50 $, 5 дней  	
Редактировать
11.	прочее  


	Верстка шаблона Wordpress (ecvisa.ru) 2000 руб., 12 часов  	
Редактировать
2.	Верстка шаблона Wordpress (autoglass98.ru) 2000 руб., 12 часов  	
Редактировать
3.	Верстка шаблона Wordpress (справки-все.рф) 2000 руб., 12 часов  

*/