<div class="container">

			<div class="product-detail">
				<div class="photo">
					<img src="http://s.4pda.to/wp-content/uploads/headbands/99/phband-99836.jpg" alt="Я знаю: что такое Root для Android" title="Я знаю: что такое Root для Android">
				</div>
				<div class="description">
					<h3>Что такое Root для Android</h3>
					</div>
				</div>
			</div>
<div class="content"><div class="content-box"><p style="text-align: justify;">Что такое Root-права на Android слышали многие, но далеко немногие получили их из опасения навредить своему устройству. Вероятно, отчасти они правы, ведь имея доступ к учетной записи главного администратора, вы автоматически получаете не только полный контроль над операционной системой с возможностью настройки вашего устройства в соответствии со своими предпочтениями, но и лазейку для непрошеных гостей.</p>

<p style="text-align: center;"><!-- PREVIOUS FIRST IMAGE {<br />
 <a data-lightbox="99836" href="http://s.4pda.to/wp-content/uploads/2013/05/android.png" mce_data-lightbox="99836" href="http://s.4pda.to/wp-content/uploads/2013/05/android.png"><img class="aligncenter size-full wp-image-99837" title="Android" src="http://s.4pda.to/wp-content/uploads/2013/05/android.png" mce_src="http://s.4pda.to/wp-content/uploads/2013/05/android.png" alt="" width="352" height="361" /></a><br />
 } PREVIOUS FIRST IMAGE --></p>

<p style="text-align: justify;"><!--more--></p>

<h2>Итак, что же такое Root?</h2>

<p style="text-align: justify;">Root (от англ. root — корень; читается «рут»), или су́перпо́льзователь — специальный аккаунт в UNIX-подобных системах с идентификатором (UID, User IDentifier) 0, владелец которого имеет право на выполнение всех без исключения операций.</p>

<p style="text-align: justify;">&nbsp;</p>

<h2>Преимущества Root</h2>

<p style="text-align: justify;">Имея доступ к профилю главного администратора (superuser) вы получаете ряд возможностей, недоступных в обычном режиме работы.</p>

<p style="text-align: justify;">В первую очередь, получение Root дает возможность удалять стандартные приложения, навязываемые производителями устройств, менять темы и ярлыки, а так же запускать специализированные приложения, существенно расширяющие возможности смартфона (обычно такие приложения требуют Root-прав). Кроме того, появляется возможность изменять системные файлы (Recovery image, Bootloader или изображения, выводимые при загрузке), запускать исполняемые файлы Linux, устанавливать приложения на карту памяти или переносить на нее кэш программ. В отдельных случаях после модификаций ОС, доступных только после получения Root-прав, возможно даже добиться небольшого, но все же увеличения производительности времени автономной работы.</p>

<p style="text-align: justify;">&nbsp;</p>

<h2>Недостатки Root</h2>

<p style="text-align: justify;">Как и во всем другом, в получении Root доступа имеются свои недостатки.&nbsp;В первую очередь, устройство лишается гарантии и в случае «чего-то такого», при условии, что вы не сможете откатить свой «девайс» на официальную прошивку, ремонтировать его придется исключительно за свой счет.</p>

<p style="text-align: justify;">Процедура рутования несложная - делая все в соответствии с описаниями можно добиться желаемого, но если у вас нет никакого опыта, потенциальный риск сохраняется -&nbsp; при неблагоприятном стечении обстоятельств устройство может превратиться в непригодный для использования «кирпич».</p>

<p style="text-align: justify;">Еще один немаловажный недостаток - открытие Root-привилегий подразумевает вмешательство в системные файлы и влечет за собой&nbsp; потерю возможности обновляться «по воздуху» (устанавливать OTA обновления). Точнее, возможность обновляться&nbsp; может и не пропасть, но последствия обновления будут непредсказуемыми.&nbsp; Самое безобидное из них - потеря root-привилегий, но возможны и более фатальные варианты - вплоть до получения «кирпича».</p>

<p style="text-align: justify;">&nbsp;</p>

<h2>Виды Root прав</h2>

<p style="text-align: justify;">Cуществует несколько видов Root прав:</p>

<ul style="text-align: justify;">
	<li> Full Root - постоянные права, снимающие установленные ограничения. Обновлять операционную систему не рекомендуется.</li>
	<li> Shell Root – аналог Full Root, но без доступа к папке system.</li>
	<li> Temporary Root – временный Root доступ. После перезагрузки устройства он пропадает.</li>
</ul>

<p style="text-align: justify;">&nbsp;</p>

<h2>Как получить Root права?</h2>

<p style="text-align: justify;">На форуме 4PDA описана масса универсальных способов и методов получения Root прав на устройствах под управлением Android. Большинство из них подразумевает использование специальных программ и компьютера.&nbsp;Среди таких программ хорошо известны Universal AndRoot, Unlock Root, z4root, Revolutionary и другие, обещающие получение желаемого в «два клика». К сожалению, не все из них способны на 100% помочь добиться желаемого, конкретно для вашего мобильного устройства. Более того, подобное программное обеспечение может определяться как вирусное, так как оно вносит изменения в ядро операционной системы Android. В данном случае антивирус отчасти прав - все эти программы являются вирусными эксплоитами, проникающими в ядро системы и при их скачивании или установке рекомендуется отключить защитное ПО.</p>

<p style="text-align: justify;">Другой способ получения Root-прав заключается в установке на смартфон <a href="http://4pda.ru/forum/index.php?showforum=268" target="_blank">модифицированой прошивки</a>. В этом случае всю работу за вас уже проделали специалисты, а вам только остается выбрать ту прошивку, которая подходит именно для вашего устройства. Кстати, там же вы найдете различные украшательства и дополнения для своей модели смартфона.</p>

<p style="text-align: justify;">Стоит отметить, что часть телефонов имеет защиту, поставленную производителем - NAND lock. Чаще всего этим грешила компания HTC, так что обладателям таких аппаратов не повезло - NAND lock запрещает производить любые изменения раздела /system (не позволит ничего писать/удалять в/из раздела /system, даже если его перемонтировать на запись), из-за чего в папку /system невозможно установить программу Superuser.</p>

<p style="text-align: justify;">В телефонах с NAND lock сделать Root все же можно, но он будет неполнофункциональным (можно получить только Shell root или Temporary Root). Уточнить, имеет ли Ваш аппарат NAND lock, можно в ветке обсуждения Вашей модели в разделе <a href="http://4pda.ru/forum/index.php?showforum=269" target="_blank">Android - Устройства</a>.</p>

<p style="text-align: justify;">&nbsp;</p>

<h2>Как проверить, что права root получены?</h2>
<ol>
	<li>Возможно (но не обязательно) появление в списке программ приложения под названием <a href="http://4pda.ru/forum/index.php?showtopic=170206" target="_blank">Superuser</a> или <a href="http://4pda.ru/forum/index.php?showtopic=318487&amp;st=420" target="_blank">SuperSU</a></li>
	<li>При запуске программ, требующих привилегий root, будет всплывать соответствующий запрос</li>
	<li>Программы, которые ранее не работали, ссылаясь на недостаток прав, теперь полностью функциональны</li>
	<li>В эмуляторе терминала при вводе команды su появляется приглашение в виде решетки: #</li>
	<li>Этот способ проверки зависит от метода получения root-прав (например, при использовании Universal Androot этот способ проверки неприемлем). В эмуляторе терминала наберите команду "/system/bin/id"[Enter]. Если в ответ вы получите "uid=0(root) gid=0(root)", то вы добились желаемого.</li>
</ol>

<p style="text-align: justify;">&nbsp;</p>

<h2>Итог</h2>

<p style="text-align: justify;">Теперь вы знаете зачем в операционной системе Android нужно получать Root-права. Некоторые пользователи считают, что Root необходим, а другие и без него живут достаточно неплохо. Выполнять эту процедуру или нет – решать только вам, только не забывайте про гарантию и все будет хорошо.</p><p class="mb_source">Источник: 4pda.ru</p></div></div></div>


See also:
<br>http://remontka.pro/reset-android-screen-lock/
<br>http://4pda.ru/forum/index.php?showtopic=440997&st=580
<br>http://4pda.ru/forum/index.php?showtopic=440997&st=100#entry20608483
<br>http://4pda.ru/forum/index.php?showtopic=440997&st=120#entry20689922
<br>http://4pda.ru/forum/index.php?showtopic=534080