<?
	return '
Русские мужские имена на букву А:

Август (стар.) – летний
Августин (стар.) – летний
Авенир (стар.) - от франц. avenir - грядущий, будущий
Авксентий (стар.) - чужой "ксенос"
Аврор / Аврорий (нов.) – сын утренней зари
Адам (стар.) – "из красной глины"
Адонис (стар.) – владыка
Алевтин (нов.) – чуждый дурного
Александр (стар.) – защитник людей
Алексей (стар.) – защитник
Альберт (нов.) – мудрый
Альбин (нов.) – "белый"
Альфред (нов.) – хороший советник
Анастасий (стар.) – воскресший
Анатолий (стар.) – восточный
Андрей (стар.) – мужчина и защитник
Анис / Анисий (стар.) – сладко пахнущий
Антон / Антоний (стар.) – вступающий в бой
Антонин (стар.) – добрый
Антуан (нов.) - иноязычное прочтение Антона
Аполлинарий (стар.) – сын солнца
Аполлон (стар.) – бог солнца
Аргент (нов.) - от франц. argent - серебряный
Аристарх (стар.) – глава лучших
Аркадий (стар.) – пастух или "Житель Аркадии"
Арсен (нов.) – мужественный
Арсений (стар.) – мужественный
Артём / Артемий (стар.) – невредимый
Артур (нов.) – большой как медведь
Атеист (нов.) – не верующий
Афанасий (стар.) – бессмертный

Русские мужские имена на букву Б:

Бажен (др.-рус.) – святой
Бенедикт (стар.) – благословенный
Богдан (слав.) – данный богом
Боеслав (слав.) – прославленный в бою
Болеслав (слав.) – более славный
Боримир (слав.) – борющийся за мир
Борис (стар.) – "борец"
Борислав (слав.) – борющийся за славу
Бронислав (слав.) – славный защитник
Будимир (др.-рус.) – миролюбивый
Булат (нов.) – "крепкий"

Русские мужские имена на букву В:

Вадим (стар.) – сеющий смуту
Валентин (стар.) – здоровый
Валерий (стар.) – сильный 
Вальтер (нов.) – управляющий людьми
Василий (стар.) – царский
Василько (нар. от Василий) – царевич
Велимир (слав.) – повелитель мира
Велислав (слав.) – прославленный
Велор / Велорий (нов.) - состоятельный
Венедикт (стар.) - иное прочтение Бенедикта
Вениамин (стар.) – древнеевр. "младший"
Виктор (стар.) – победитель
Вилен (нов.) - сокращение от В.И.ЛЕНин
Виссарион (стар.) – лесной человек
Виталий (стар.) – жизненный
Витольд (слав.) – лесной властитель
Влад (слав.) – владеющий
Владилен (нов.) - аналогично ВЛАДИмир ЛЕНин
Владимир (стар., слав.) – владеющий миром
Владислав (стар., слав.) – владеющий славой
Владлен (нов.) - аналогично ВЛАДимир ЛЕНин
Воин (др.-рус.) – "воин"
Воислав (слав.) – "прославленный в войне"
Володар (старослав.) - "владыка"
Вольдемар / Вальдемар (нов.) – знаменитый властитель
Вольмир / Волемир (слав.) – повелитель мира
Всеволод (стар., др.-рус.) – властелин всего народа
Всемил (славв.) – всем мил
Вячеслав (стар., слав.) – не раз прославившийся

Русские мужские имена на букву Г:

Гавриил / Гаврила / Гаврило / Гаврил (стар.) – божественный воин
Галактион (стар.) – звездный
Гарри / Гаррий (нов.) – терпимый
Гелиан / Гелий (нов.) - солнечный
Гений (нов.) – "гений"
Геннадий (стар.) – родовитый
Георгий (стар.) – земледелец
Герман (стар.) – родной
Гертруд (нов.) - ГЕРой ТРУДа
Глеб (стар., др.-руск.) – большой, высокий
Гордей / Гордий (слав.) – гордый
Горимир (слав.) – "светлый мир"
Горислав (слав.) – "светлая слава"
Гранит (нов.) – "твердый"
Григорий (стар.) – не спящий

Русские мужские имена на букву Д:

Давыд / Давид (стар.) – любимый
Дамир (нов.) – миролюбивый
Дан (стар.) – бог луны
Даниил / Данила / Данило / Данил (стар.) – "Божий суд"
Дар (нов.) – "дар"
Декабрий (нов.) – зимний
Денис (нар. от стар. Дионисий) – бог жизненных сил природы
Джеральд (нов.) - иное прочтение Гаральда
Джозеф (нов.) - иное прочтение Жозефа, Иосифа, Осипа
Джон (нов.) - иное прочтение Ивана
Дионисий / Дионис (стар.) – бог растительности
Дмитрий / Димитрий (стар.) – бог плодородия
Добрыня (др.-рус.) – добрый молодец
Дональт (стар.) – властелин мира
Донат (стар.) – крепкий

Русские мужские имена на букву Е:

Евгений (стар.) – благородный
Евдоким (стар.) – хорошо прославленный
Егор (нар. от Георгий, Егорий) – земледелец
Еруслан (др.-рус.) – "лев"
Ефим (стар.) – благочестивый

Русские мужские имена на букву Ж:

Ждан (др.-рус.) – жданный, тот, которого ждут

Русские мужские имена на букву З:

Захар (стар.) – "Божья память"
Зиновий (стар.) – "Зевсова сила"
Зорий (нов.) – утренний

Русские мужские имена на букву И:

Ибрагим (нов.) - иное прочтение Абрама, Авраама, Аврома
Иван (нар. от Иоанн) – "божий дар"
Игнатий / Игнат (стар.) – неведомый
Игорь (стар., др.-рус.) – защитник бога
Исидор / Сидор (стар.) – покровитель плодородия
Июлий (нов.) – летний, рожденный в июле, середине лета, по летнему теплый и светлый

Русские мужские имена на букву К:

Казимир (слав.) – объявляющий о мире
Карл (нов.) – смелый
Касьян (нар. от стар. Кассиан) – пустой
Ким (нов.) - Коммунистический Интернационал Мира
Киприан (стар.) - уроженец Кипра или медный
Кир (стар.) – господин
Кирилл (стар.) – владыка
Клавдий (стар.) – хромой или из рода Клавдиев
Клемент (стар.) – милостивый
Климент / Клим (стар.) – снисходительный
Климентий / Клементий (нар. от Климент) – кроткий
Колумбий (нов.) - "голубь"
Кузьма / Козьма (нар. от стар. Косма) – украшенный
Куприян (нар. от Киприан) - уроженец Кипра или медный

Русские мужские имена на букву Л:

Лавр (стар.) – знаменитый
Лаврентий (стар.) – увенчанный лаврами
Лазарь (стар.) – "Божья помощь"
Ларион (нар. от Иларион) – радостный
Лев (стар.) – "лев"
Леонард (нов.) - сильный
Леонид (стар.) – сын льва
Леонтий (стар.) – львиный
Лука (стар.) – "счастье"
Лукьян / Лукиан (стар.) – счастливый
Любим (др.-рус.) – красавец
Любомир (слав.) – любимец мира
Люксен / Люциан (нов.) - светлый

Русские мужские имена на букву М:

Маврикий (стар.) - черный
Май (нов.) – теплое сердце
Майслав / Маеслав (нов.) – прославившийся в мае
Макар / Макарий (стар.) – счастливый
Макс (нов.) – величавый
Максим (стар.) – величавый
Максимильян / Максимилиан (стар.) – величавый
Милий (стар.) – милый
Милонег (слав.) – милый
Милослав (слав.) – слава мила Мир (нов.) – "мир"
Мирон (стар.) – добрый
Мирослав (слав.) – победитель
Михаил / Михайло (стар.) – равный Богу
Модест (стар.) – скромник
Моисей (стар.) – извлеченный из воды
Монолит (нов.) – незыблемый

Русские мужские имена на букву Н:

Назар / Назарий (стар.) – посвященный Богу
Натан (стар.) – дарованный
Наум (стар.) – утешение
Неон (стар.) – блистающий
Неонил (стар.) – принципиальный
Нестор / Нестер (стар.) – возвратившийся на родину
Никандр (стар.) - победитель мужчин
Норд (нов.) - север(ный)

Русские мужские имена на букву О:

Овидий (стар.) – спаситель
Одиссей (нов.) – сердитий
Октавиан (стар.) - (римское) - восьмой
Октябрин (нов.) – осенний
Октябрь (нов.) – осенний
Олег (стар., др.-рус.) – святой
Орест (стар.) – дикарь
Осип (нар. от Иосиф) – приумноженный
Оскар (стар.) – "Божье копьё"

Русские мужские имена на букву П:

Павел (стар.) – маленький
Палладий (стар.) - посвященный Афине Палладе
Пантелеймон / Пантелей (стар.)
Панфил (стар.) - любящий всех
Пересвет (др.-рус.) – светлый
Пётр (стар.) – "скала" или "камень"
Прохор (стар.) - руководитель хора

Русские мужские имена на букву Р:

Радий (нов.) - радостный, "радий"
Радим (слав.) – родной
Радислав (слав.) – рад славе
Радомир (слав.) – рад миру

Русские мужские имена на букву С:

Савва / Сава (стар.) – желанный
Савелий (стар.) – желанный
Свет (нов.) – "свет"
Светлан (слав.) – светлый
Светозар (слав.) – светлый как заря
Светослав (слав.) – "слава светла"
Святогор (др.-рус.) - "святая гора"
Святополк (др.-рус.) – "святой полк"
Святослав (слав.) – "слава свята"
Север (стар.) – "север"
Северин (стар.) – холодный
Северьян / Севериан (стар.) – северный
Северян (нов.) – северный
Семён (нар. от стар. Симеон) – услышанный Богом в молитве
Серафим (стар.) – пламенный
Сергей (стар.) – высокочтимый
Сигизмунд (нов.) - …
Сталь / Сталий (нов.) – твердый
Станислав (слав.) – станет славным
Степан / Стефан (стар.) – "венок"

Русские мужские имена на букву Т:

Тарас (стар.) – беспокойный
Теймураз (нов.) - аналог Тимуру
Тристан (стар.) - грустный (tristia)
Трифон (стар.) – изнеженный
Трофим (стар.) – питомец

Русские мужские имена на букву Ф:

Фадей / Фаддей (стар.) – "похвала"
Февралин (нов.) – зимний
Фёдор (стар.) – Божий дар
Федор (стар.) – Божий дар
Феликс (стар.) – преуспевающий
Филимон (стар.) – любимый
Филипп (стар.) – любящий лошадей
Флегонт (стар.) - …
Флорентий (стар.) – цветущий
Флоренц (нов.) – цветущий
Флорин (нов.) – цветущий
Фрол (нар. от стар. Флор) – цветущий

Русские мужские имена на букву Х:

Харитон (стар.) – благодетель
Храбр (др.-рус.) – храбрый
Христоф (стар.) - (Христофор) - несущий Христа

Русские мужские имена на букву Э:

Эдуард (нов.) – заботящийся о собственности
Электрон (нов.) - янтарь
Эльбрус (нов.) – "гора"
Энергий (нов.) - энергичный
Эрнест / Эрнст (нов.) – серьезный
Ювеналий (стар. от Иувеналий) - юный
Юджин (нов.) – благородный
Юлиан (стар. от Иулиан) – кудрявый
Юлий (стар. от Иулий) – пушистый
Юпитер (нов.) - "юпитер"
Юрий (стар., нар. от Георгий) – земледелец

Русские мужские имена на букву Я:

Яков (стар. от Иаков) – подражающий Богу
Ян (нов.) – "Бог солнца"
Януарий (стар. от Ианнуарий) - январский
Яромир (стар., слав.) – "солнечный мир"
Ярополк (стар., слав.) – "солнечный"
Ярослав (стар., слав.) – "горящая слава" или славящий Ярилу, древнеславянского бога

Русские женские имена на букву А:

Августа / Августина (стар.) – летняя
Авдотья (нар. от Евдокия) – прославившаяся
Аврелия (нов.) - золотая
Аврора (нов.) – богиня утренней зари
Агапия (стар.) - от греч. агапао - люблю
Агата(нов.) / Агафья / Агафия (стар.) - от греч. агатос - хорошая, честная, добрая
Аглаида (стар.) – сверкающая / дочь красоты, прелести
Аглая (нов.) – блестящая
Агнеса / Агнесса (стар.) – целомудренная
Агния (стар.) – непорочная или огненная
Агриппина / Агрефена (стар.) - из римского родового имени
Agrippus (Агриппа)
Ада (стар.) – украшение
Адель / Аделия / Аделаида (др.-герм.) - от адаль — благородный и хейд — состояние, сословие.
Аза (стар.) – первая
Азалия (нов.) - цветущий куст
Аида (нов.) - дарующая урожай
Акилина / Акулина (стар.) - орлиная
Аксинья (нар. от Ксения) - гостеприимная и в то же время чужая ("ксенос")
Алевтина (стар.) – чуждая дурного
Александра (стар.) – защитница людей
Алёна (нар. от Елена) – солнечная
Алина (нов.) – чужая
Алиса (нов.) – обаятельная Алла (стар.) – себялюбивая
Альбина (стар., ср. нов. Альвина) – «белая»
Анастасия (стар.) – воскресшая
Анатолия (нов.) - восточная
Ангелина (стар.) – ангелица
Анжела (нов.) - ангельская 
нимаиса (стар.) - душевная
Анисия / Анисья (стар.) - сладко пахнущая
Анита (нов.) - строптивая
Анна (стар.) - «благодать»
Антонина / Антонида (стар.) - добрая
Антония (стар.) - вступающая в бой
Анфиса / Анфуса (стар.) - цветущая
Аполлинария (стар.) - богиня солнца
Ариадна (стар.) - спящая
Арина (нар. от Ирина) - спокойная
Аркадия (нов.) - пастушка
Арсения (нов.) - мужественная
Артемия (стар.) - невредимая
Астра (нов.) – «цветок»
Астрид (сканд.) - страстная
Афанасия (стар.) - бессмертная
Афродита (стар.) - возникшая из морской пены
Аэлита (нов.) - от греч. аэр - воздух и литос - камень

Русские женские имена на букву Б:

Бажена (др.-рус.) – святая
Беата (нов.) – благословляющая
Беатриса (стар.) – благословляющая
Бела (слав.) – прекрасная
Белла (нов.) – прекрасная
Берта (нов.) – великолепная
Богдана (слав.) – данная богом
Болеслава (слав.) – более славная
Борислава (слав.) – борющаяся за славу
Бронислава (слав.) – славная защитница

Русские женские имена на букву В:

Валентина (стар.) – здоровая
Валерия (стар.) – сильная
Ванда (слав.) – гостеприимная
Варвара (стар.) – дикарка
Василина (нов.) – царская
Василиса (стар.) – царственная
Васса (стар.) – царица
Вацлава (слав.) - более славная
Венера (стар.) – «любовь»
Вера (стар.) – «вера»
Вероника (стар.) – библейское имя
Веселина (слав.) – жизнерадостная
Веста (стар.) – покровительница домашн. очага
Видана (слав.) – видная
Викторина (стар.) – победительница
Виктория (стар.) – «победа»
Вилена (нов.) - от В.И.ЛЕНин
Виола / Виолетта / Виоланта (нов.) – «фиалка»
Виринея (стар.) - зеленеющая, свежая
Виталия / Виталина (нов.) – жизненная
Влада (слав.) – владеющая
Владилена (нов.) - cокращение от «Владимир Ильич Ленин»
Владимира (нов.) – владеющая миром
Владислава (слав.) – владеющая славой
Владлена (нов.) - аналогично Владилена
Власта (слав.) – властительница
Воля (нов.) – вольная
Всеслава (слав.) – везде славная

Русские женские имена на букву Г:

Гайя (нов.) - супруга
Гали (стар.) – яркая
Галина (стар.) – спокойная
Ганна (укр. нар. от Анна) – благодатная
Гаяна / Гаяния (стар.) - от греч. ге — земля
Гелена (нов. польск. от Елена) – светлая
Гелия (нов.) – солнечная (Гелиос)
Гелла (стар.) – упавшая в воду
Гертруда (нов.) – покровительница женщин, герой труда
Глафира (стар.) – утонченная
Гликерия (стар.) - сладкая
Глория (стар.) – "слава"
Голуба (др.-рус.) – нежная
Горислава (слав.) – разжигающая славу

Русские женские имена на букву Д:

Дайна (нов.) - иное прочтение Дианы
Дана (нов.) – богиня луны
Дарья / Дария (стар.) – победительница
Дарина (нов.) – дарящая
Дарьяна (нов.) – победительница
Декабрина (нов.) – зимняя
Дея / Дия (нов.) - божественная
Джульетта (стар.) - аналог Юлии
Диана (нов.) - божественная
Дина / Диния (нар. от стар. Дигна) – «вера»
Диодора (стар.) - данная богом
Дионисия (стар.) – покровительница виноделия
Добрава (др.-рус.) – добрая
Домна / Домина (стар.) - госпожа, хозяйка дома
Домника / Доминика (стар.) – принадлеж. Богу
Дорофея / Доротея (стар.) - от греч. дорон - подарок, дар и теос - бог.

Русские женские имена на букву Е:

Ева (стар.) – подательница жизни
Евгения (стар.) – благородная
Евдокия (стар.) – хорошо прославленная
Евпраксия (стар.) - делающая добрые дела, добродетельница
Екатерина (стар.) – непорочная
Елена (стар.) – избранная
Елизавета (стар.) – почитающая Бога
Ефимия / Евфимия (стар.) - благочестивая
Ефросиния / Евфросиния (стар.) - от греч. эуфросине - радость, веселье

Русские женские имена на букву Ж:

Жанна (нов.) – «дар Бога»
Ждана (др.-рус.) – ждущая

Русские женские имена на букву З:

Зарина / Зорина (нов.) – светлая
Звенислава (слав.) – разносящая славу
Зинаида (стар.) – рожденная Зевсом
Зиновия (стар.) – «Зевсова сила»
Злата (слав.) - золотая
Зоя (стар.) – «жизнь»

Русские женские имена на букву И:

Иванна (нар. от Иоанна) – «божий дар»
Ида (нов.) - горная, "потомок"
Илария (стар.) - веселая
Инга (нов.) - от др.-сканд. ингвио - имя бога изобилия
Инесса (нов.) – безмятежная
Инна (стар.) – имя Рима / бурный поток
Иоанна (стар.) – «божий дар»
Иона (стар.) – «голубь»
Ипатия (нов.) - имеющая отношение к лошадям, лошадиная (гиппос)
Ипполита (нов.) – от "(г)иппо" - лошадь и "литос" - камень, плита
Ираида (стар.) – богиня радуги
Ироида (стар.) - героическая, дочь героя
Ирина (стар.) – «мир»
Исидора (стар.) – покровительница плодородия
Искра (нов.) - яркая
Ифигения (стар.) – бессмертная
Ия (стар.) - от греч. иа - фиалка

Русские женские имена на букву К:

Капитолина (стар.) - главная
Каролина (нов.) - смелая
Катерина (нар. от Екатерина) – непорочная
Кира (стар.) – «госпожа»
Кирилла (стар.) – владычица
Клавдия (стар.) – хромая или из рода Клавдиев
Клара (нов.) – ясная
Клариса / Кларисса (нов.) – светлая
Клеопатра (стар.) – красавица
Конкордия (стар.) - согласная, соглашающаяся
Констанция (стар.) – стойкая
Кристина (нов.) – крещеная
Ксения (стар.) - чужая

Русские женские имена на букву Л:

Лада (др.-рус.) – милая
Лариса (стар.) – «чайка»
Лениана (нов.) - от Ленина
Ленина (нов.) - от Ленина
Леонида (стар.) – "потомок льва"
Леонила (стар.) – львица
Леонтия (нов.) – львиная
Леся (нов.) – мужественная
Ливия (стар.) - родом из Ливии
Лидия (стар.) – первая
Лилиана (нов.) – цветущая
Лилия (нов.) – «цветок»
Лина (нов.) – самостоятельное имя или уменьшительное от Элина
Любава (др.-рус.) – красавица
Любовь (стар.) – «любовь»
Любомира (слав.) – любимица мира
Людмила (стар., слав) – милая людям

Русские женские имена на букву М:

Мавра (стар.) - темнокожая, смуглянка
Магда (нов.) - см. Магдалина
Магдалина (стар.) – звучащая / родом из Магдалы, в Палестине
Мадлен (нов.) - см. Магдалина
Майя / Мая (нов.) – богиня весны
Мальвина (др.-герм.) – От маль — справедливость и вин — друг..
Маргарита (стар.) – «жемчужина»
Марина (стар.) – морская
Мария / Марья (стар.) – горькая
Мари (нов.) - вариант Марии
Марта (нов.) – владычица
Марфа (стар.) – наставница
Матильда (др.-герм.) - от махт — сила и хильд — сражение
Матрёна / Матрона (стар.) - госпожа, мать семьи, матушка
Мелания / Меланья (стар.) - темная, смуглая
Милада (слав.) – добрая
Милана / Милена / (слав.) – милая
Милица (стар., слав.) – милая на лицо
Милослава (слав.) – слава мила
Мира (слав.) – мирная
Мирра (слав.) – благовонная, благоухающая
Мирослава (слав.) – победительница
Митродора (гр.) - дар матери.
Млада (слав.) – молодая
Мстислава (слав.) - завоевательница
Муза (стар.) – богиня искусства / вдохновительница

Русские женские имена на букву Н:

Надежда (стар., слав.) – «надежда»
Надия (нар., от Надежда) – «надежда»
Нана (стар.) - нимфа
Настасья (нар., от Анастасия) - воскресшая
Наталья / Наталия (стар.) – родная
Нелли (нов.) – молодая
Неонила (стар.) – принципиальная
Ника (стар.) – «богиня победы». Имя появилось от Богини победы Ники Самофракийской жившей в древней Греции.
Нина (стар.) – правительница
Нинель (нов.) - "Ленин" наоборот
Новелла (стар.) - новая
Нора (нов.) – холодная

Русские женские имена на букву О:

Оксана (укр. нар., от Ксения) – гостеприимная
Октавия (стар.) - восьмая
Октябрина (нов.) – осенняя
Олеся (укр.нар., от Александра) – мужественная
Олимпиада (стар.) – сохраняющая спокойствие
Олимпия (нов.) – названная в честь Зевса
Ольга (стар., др.-рус.) – святая

Русские женские имена на букву П:

Павла (стар.) – маленькая
Павлина (стар.) – красавица
Платонида (стар.) - потомок Платона
Поликсена (стар.) – троянская царевна
Полина (нов.) – предсказательница
Правдина (нов.) – честная
Прасковья (нар., от стар. Параскева) - "пятница"

Русские женские имена на букву Р:

Рада (стар., слав.) – приносящая радость
Радмила (слав.) – радостная
Раиса (стар.) – покорная
Ревмира (нов.) - РЕВолюционный МИР
Регина (стар.) – царица
Рената (нов.) - вновь родившаяся
Римма (стар.) – римлянка
Рогнеда (слав.) - допущенная в совет равных/совет мужчин
Роза (нов.) – «цветок»
Розалия (нов.) – цветущая
Розана (нов.) – цветочек
Ростислава (слав.) – растущая для славы
Руслана (нов.) – львица
Руфина / Руфь (стар.) - красная, рыжая

Русские женские имена на букву С:

Сабина / Савина (стар.) - из рода сабинов, сабинянка
Саломея / Соломея (стар.) – вариант имени Соломония, производного от имени Соломон - "благополучный"
Светлана (др.-рус.) – светлая
Светозара (слав.) – светлая заря
Светослава (нов.) – слава светла
Свобода (нов.) – «свобода» 
Святослава (слав.) – слава свята
Севастьяна (стар.) – "высокочтимая, священная", вариант мужского имени Севастьян
Северина (нов.) – северная
Селена / Селина (нов.) - луна
Серафима (стар.) – пламенная
Слава (слав.) – «слава»
Славяна (слав.) – славянка
Снежана (нов.) – холодная
Софья / София (стар.) – «мудрость»
Станислава (слав.) – стань славной
Стелла (стар.) – звезда
Степанида / Стефанида (стар.) – «венок»
Стефания (стар.) – «венок»
Сусанна / Сосанна (стар.) – упрямая/ от древнееврейского -"шушанах"-"белая лилия"
Сюзанна (нов.) – упрямая

Русские женские имена на букву Т:

Таира (нов.) – настойчивая
Таисия (стар.) - "богоугодница" и "любительница детей"
Тамара (стар.) – «смоковница»
Тамила / Томила (др.-рус.) – томящаяся
Татьяна (стар.) – учредительница

Русские женские имена на букву У:

Ульяна (нар., от стар. Иулиания, ср. Юлиана)
Услада (нов.) – сладкоголосая
Устинья (нар., от стар. Иустина, ср. Юстина)

Русские женские имена на букву Ф:

Фаина (стар.) – сияющая
Феликсана (нов.) – преуспевающая
Фелицата / Фелицитата (стар.) – счастливая
Фелиция (стар.) – «счастье»
Федора / Феодора (стар.) – «Божий дар»
Феодосия / Феодосья (стар.) – землевладелица
Филадельфия (нов.) - любящая Дельфы
Флавия (стар.) - из рода Флавиев
Флора / Флория (нов.) – богиня цветов
Флорентина (нов.) – цветущая
Флоренция (нов.) - цветущая
Флориана (нов.) - юная или цветущая
Фотина (стар.) - по святцам Светлана

Русские женские имена на букву Х:

Харита (стар.) – богиня красоты
Харитина (стар.) – красавица
Хиония (стар.) – нимфа
Христина (стар., ср. нов. Кристина) - Христова

Русские женские имена на букву Ч:

Чеслава (слав.) – честная слава

Русские женские имена на букву Э:

Эвридика (нов.) – укушенная змеей
Элеонора (нов.) – сложная
Эльвира (нов.) – уравновешенная
Эльмира (нов.) – спокойная
Эльза (нов.) – мужественная
Эмма (нов.) – самокритичная
Эрика (нов.) – создательница храма

Русские женские имена на букву Ю:

Юлиана (стар., от Иулиания) – кудрявая
Юлия (стар., от Иулия) – пушистая
Юманита (нов.) - человечная, человеческая
Юнона (стар.) – покровительница брака

Русские женские имена на букву Я:

Ядвига (нов.) – богатая воительница
Яна (нов.) – «Богиня солнца»
Янина (нов.) – светлая
Яромира (слав.) – «солнечный мир»
Ярослава (слав.) – «горящая слава» или аналогично мужскому имени Ярослав
	';