Люди не хотят богаства, признания, любви, денег, уважения, славы, успеха.
они не хотят ничего из этого.
Философы подметили, что они хотят быть счастливы, а уже счастливым каждого из нас делает что-то свое:
кого то слава, кого-то деньги, кому-то нужно чтобы его любили, а кто-то хочет быть во главе всего.
Но я пришел к выводу, что людям нужно не просто счастье.
Ведь что значит быть счастливым?
Иметь все, или не риковать ничем?
Знать истину или быть в игре?
Править всем или плыть по течению?
Счастье не говорит ни о чем из этого, потому что для каждого оно свое.
Кого-то делает счастливым удовлетворение, а кого-то жажда.
Кто-то счастлив истине, а кто-то обману.
Кого-то радует ласка, а кого-то прямота.
Люди хотят остроты ощущений.
И этим полнится их жизнь.
Острота ощущений делает людей счастливыми, наполняет жизнь смыслом, радует и помогает жить.
Чем острее мы чувствуем, тем сильнее понимаем, что живем.
И это вовсе не означает счастье, потому что не всех радует быть в сладком туманном сне.
Не всех радует умопомрачительная радость и опьяняющие дурости.
Чувства заглушают все факторы окружения.
Отсутствие чувств превращает человека в безжизненный объект.
И тогда включаются инстинкт, что требуется что-то изменить.
И жизнь этим инстинктом и есть смысл жизни таких людей.