<?
$page['title']='MaxSens — Самое важное без лишних слов.';
$page['url']='maxsens';
$page['header']='Павел Дуров и большая часть разработчиков социальной сети Vkontakte.ru переходят в Telegram.com';
$page['epigraph']='Лучшее, что нам доступно, это самопознание.';
$page['source']='По материалам "Ведомости", "Forbes", "Известия" и некоторых других источников.';
$page['date']['year']='2014';
$page['date']['month']='01';
$page['date']['day']='21';
$page['article']='<p>Павел Дуров покидает пост гендиректора «ВКонтакте», за которым уходит и большая часть разработчиков. Такая ситуация сложилась из-за сложной акционерной структуры ВКонтакте. Ранее основатель самой популярной социальной сети в русскоязычном сегменте интернета называл текущую структуру акционеров «нежизнеспособной» и говорил о необходимости ее изменения. Фонд UCP, неожиданно для всех купивший 48% социальной сети «ВКонтакте» в апреле 2013 года у Вячеслава и Михаила Мирилашвили и Льва Левиева, выявлял свое недоволен фигурой Павла Дурова во главе компании и допускал возможность его замены. «Может быть, он сам не знает, что он хочет. При этом в самой компании и на рынке есть другие талантливые ребята, которым будет интересно заниматься развитием «ВКонтакте». Возможно, кто-то из них возглавит компанию в ближайшем будущем». Павел давно говорил о необходимости изменений в акционерной структуре «ВКонтакте». «Текущая структура представляется нежизнеспособной», — говорит он.
</p><p>
Теперь же Павел Дуров покинул пост гендиректора «ВКонтакте». Команда разработчиков уходит вместе с ним в новый проект — Telegram. Георгий Лобушкин, пресс-секретарь «ВКонтакте», отказался прокомментировать ситуацию. 
</p><p>
— Мне пока нечего вам ответить, — отвечает Лобушкин на вопрос, ушел ли Дуров с поста гендиректора компании. 
</p><p>
Сейчас представители соцсети активно ищут новых разработчиков, рассылая приглашения на работу сотрудникам таких крупных компаний, как Mail.Ru Group и «Яндекс».
</p><p>
По сообщениям, большая часть команды Дурова покинула социальную сеть вслед за гендиректором и перешла в Telegram — его новый проект, сервис безопасного обмена сообщениями и файлами (до 1 Гб с возможностью докачки). В Telegram используется протокол передачи данных MTProto, разработанный братом Павла Николаем Дуровым, техническим директором «ВКонтакте».
</p><p>
Причины ухода Дурова и команды не оглашаются, но с оглядкой на прошлое можно предположить, что Дуров, скорее всего, ушел из-за конфликта с некоторыми акционерами компании, у которых есть большое желание лучше монетизировать сервисы и получать больше денег от «ВКонтакте». Дуров же хотел идти по другому пути, он делал сервис для пользователей. Он пытался пойти на компромисс, но инвесторам хотелось большего. Видимо, настала грань, которую он не смог перейти. Вспоминая аналогичную историю с «Рамблером», когда оттуда ушла первая команда, проект утратил лидерство. Как новые разработчики смогут разобраться в том, что было сделано до них? Скорее всего, революционного развития «ВКонтакте» больше не будет.
</p><p>
«Общий язык с новыми акционерами найти не удается — они предпочитают действовать исключительно методом угроз и прессинга», — говорит Дуров, который обвиняет сотрудников фонда в том, что те «параноидально ищут везде подвох» и ведут себя не как финансисты, а как сотрудники ФСБ.
</p><p>
В ответ представитель UCP заявил, что и у фонда накопились вопросы к Дурову. «У нас есть обоснованные подозрения, что он сознательно вводит в заблуждение акционеров и сотрудников «ВКонтакте», — пишет Юрий Качуро. — За многие годы работы в ВК у Павла, к сожалению, так и не сложилось уважительного отношения к акционерам и не вошло в привычку соблюдать акционерное соглашение».
</p><p>
Дуров в ответ заявил, что акционерное соглашение было нарушено в апреле этого года «в ходе тайной продажи 48% ВКонтакте», когда был нарушен пункт, по которому акции соцсети должны были быть сначала предложены существующим акционерам. «Объяснения в духе «мы покупали не акции, а компании, которые были созданы только для того, чтобы владеть этими акциями», на мой взгляд, отдают мошенничеством и противоречат духу Right of First Refusal», — говорит Дуров.
</p><p>
«У руководителя компании (CEO) есть безусловное обязательство перед акционерами работать на благо общего бизнеса. Хочешь развивать новые личные конкурентные проекты – поступай корректно и профессионально: уходи, цивилизованно передавай дела новому руководителю», — пишет Качуро, добавляя, что у UCP сложилось впечатление, что Дуров выбрал другой путь — не спеша развивать ВК и сосредоточить усилия на личных проектах DF/Telegram, в том числе используя ресурсы ВК и ее сотрудников.
</p><p>
Такой сценарий представитель UCP не считает худшим. В качестве крайне негативного сценария развития событий Качуро называет намерение Дурова «полностью угробить ВК и переключиться на личные проекты».  «Но для этого нужен благовидный предлог, отсюда и родилась версия о «давлении акционеров и юридической агрессии», — объясняет он интервью Дурова «Ведомостям».
</p><p>
UCP, по словам его представителя, привлек американских юристов, после чего Дуров заявил Forbes, что готов к судебному разбирательству: «С удовольствием докажу свою позицию в суде, для этого у нас все готово».
</p><p>
Дурова обвиняет UCP в том, что пришлось отложить IPO «ВКонтакте». По словам Качуро, UCP неоднократно ставил вопрос перед акционерами о проведении IPO, однако все кончилось решением создать рабочую группу, которая изучит возможности публичного размещения акций «ВКонтакте». «Мы хотим видеть ВК сильной публичной компанией со значительной капитализацией, с мотивированными сотрудниками и  выстроенными минимально необходимыми (но необходимыми!) бизнес-процессами.  В мире есть много успешных примеров подобной трансформации, — завершает Качуро. — В последние месяцы у нас все больше и больше сомнений в том, что Павел Дуров способен на такую трансформацию». Дуров, в свою очередь, уверен в блестящих перспективах IPO социальной сети, «если компании удастся прийти к жизнеспособной структуре акционеров».
</p><p>
С какой целью, в чьих интересах и за какую сумму UCP приобрел долю социальной сети, так и осталось неясным. UCP утверждает, что состав консорциума раскрыт и никаких интересов третьих лиц и их интересов не существует. Отвечая на вопросы Forbes, представитель UCP сообщил, что с момента покупки стоимость «ВКонтакте» выросла, однако сейчас UCP не планирует продавать свой пакет.  «Но мы финансовый инвестор, и любое интересное предложение всегда может быть рассмотрено», — уточнят Качуро.
</p><p>
По мнению экспертов, развитие соцсети может остановиться.
</p><p>
Сейчас социальной сетью «ВКонтакте» владеют Mail.ru Group (39,9%), сам Дуров (12%) и фонд UCP 48%.
</p>';